{
	"General Interest" : [{
			"Podcast Title" : "Simple Programmer Podcast",
			"Website URL" : "https://simpleprogrammer.com",
			"Description" : "John Sonmez wants to help you become more successful, make more money, deal with difficult coworkers and be so productive everyone thinks you must be abusing a prescription for Ritalin. Listen in every Monday, Wednesday and Friday, as Simple Programmer founder, John Sonmez, answers questions, interviews guests and shares everything he knows to help you become a top performing software developer. The Simple Programmer Podcast is a short podcast that is a mix of career advice, philosophy and soft skills from successful author and software developer, John Sonmez. John is the founder of http://simpleprogrammer.com , one of the most popular software development blogs, and the author of the best-selling book, \"Soft Skills: The Software Developer's Life Manual.\" (http://simpleprogrammer.com/softskills ) Geared towards a programmer or software developer audience, but contains practical advice on: Career development Entrepreneurship Fitness Finance Productivity Personal development And more... That anyone can benefit from. Each episode is between 5 and 10 minutes long with at least 3 new episodes each week.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/simple-programmer-podcast/id998357224",
			"Episodes John Was On" : "All of them!"
		}, {
			"Podcast Title" : "Get Up and CODE",
			"Website URL" : "http://getupandcode.com/",
			"Description" : "This podcast is all about fitness and nutrition with an IT slant. If you are interested in technology and fitness, this podcast might be exactly what you are looking for. The podcast started with John Sonmez and Iris Classon in 2013, two experienced developers as well as fitness geeks. In 2015 Robert Navarro started hosting the podcast after John Sonmez handed him the keys to the castle and allowed him to continue the tradition of helping others reach both their fitness and career goals. In this podcast they share all they know about getting in shape, losing weight, gaining muscle and eating right in their weekly discussion about all things fitness and nutrition. Want to know how to really get those 6 pack abs? Are carbs really bad for you? John and Iris answer all these questions and more in this short weekly podcast with about fitness and nutrition from engineering minds. Here is a short sampling for some of the topics discussed in this podcast:: fitness, nutrition, software development, programming, muscle, weight training, lifting, running, 5ks, marathons, jogging, workout, health, healthy living, aerobics, weight loss, exercise, diet, motivation.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/get-up-and-code!/id646958161?mt=2",
			"Episodes John Was On" : "Just about all of them!"
		}, {
			"Podcast Title" : "Almost Better Than Silence",
			"Website URL" : "http://almostbetterthansilence.com/",
			"Description" : "A comedy podcast about video games that features technology news, guest interviews, and conversation games!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/almost-better-than-silence/id953967760?mt=2",
			"Episodes John Was On" : "Episode 18 talking about Soft Skills and marketing yourself as a software developer and we play a conversation game!\nhttp://almostbetterthansilence.com/2015/03/abts-018-john-sonmez-interview/\nEpisode 96, to have more fun\nhttp://almostbetterthansilence.com/2016/03/abts-096-entreprogrammers-stop/"
		}, {
			"Podcast Title" : "Away from the KeyBoard",
			"Website URL" : "http://awayfromthekeyboard.com/category/podcasts/",
			"Description" : "Away From The Keyboard is where technologists tell their stories of how they started, how they grew, how they learned, and how they unwind. Hosted by software developers Cecil Phillip and Richie Rump, Away From The Keyboard looks at the human side of technology in a fun and informative way. New episodes are released every Tuesday.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/away-from-the-keyboard/id987544504?mt=2",
			"Episodes John Was On" : "Episode 2: John Sonmez Makes It Simple\nhttp://awayfromthekeyboard.com/2015/04/28/episode-2-john-sonmez-makes-it-simple/"
		}, {
			"Podcast Title" : "CodeNewbie",
			"Website URL" : "http://www.codenewbie.org/podcast",
			"Description" : "Stories from people on their coding journey.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/codenewbie/id919219256?mt=2",
			"Episodes John Was On" : "Ep. 109 Simple Programmer\nhttp://www.codenewbie.org/podcast/simple-programmer"
		}, {
			"Podcast Title" : "Coder Radio",
			"Website URL" : "http://www.jupiterbroadcasting.com/show/coderradio/",
			"Description" : "A weekly talk show taking a pragmatic look at the art and business of Software Development and related technologies.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/coder-radio-mp3/id534941512?mt=2"
		}, {
			"Podcast Title" : "Developer on Fire",
			"Website URL" : "http://developeronfire.com/",
			"Description" : "Developer On Fire with Dave Rael is an interview podcast with inspiring and successful software professionals telling personal stories about their experiences with delivering value. It is a chance for you to get to know your favorite geeks and learn more about who they are, how they deliver, and what makes them tick. Learn from and get to know special geeks like Matt Wynne, Rob Eisenberg, Udi Dahan, Ted Neward, John Sonmez, Phil Haack, and David Heinemeier Hansson.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/developer-on-fire/id1006105326?mt=2",
			"Episodes John Was On" : "Episode 001 | John Sonmez: Simple Programmer\nhttp://developeronfire.com/episode-001-john-sonmez-simple-programmer"
		}, {
			"Podcast Title" : "Developer Tea",
			"Website URL" : "http://spec.fm/podcasts/developer-tea",
			"Description" : "A 10 minute podcast for developers! Developer Tea is engineered to be a highly-concentrated, short, frequent podcast specifically for developers who like to learn on their tea (and coffee) break.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/developer-tea/id955596067?mt=2",
			"Episodes John Was On" : "Episodes, 21 and 22 talking about being the top 1% of developers\nhttp://spec.fm/podcasts/developer-tea/7976"
		}, {
			"Podcast Title" : "FLOSS Weekly",
			"Website URL" : "https://twit.tv/shows/floss-weekly",
			"Description" : "We're not talking dentistry here; FLOSS all about Free Libre Open Source Software. Join host Randal Schwartz and his rotating panel of co-hosts every Tuesday as they talk with the most interesting and important people in the Open Source and Free Software community. Records live at https://twit.tv/live every Tuesday at 12:30pm Eastern / 9:30am Pacific / 17:30 UTC.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/floss-weekly-mp3/id140847216?mt=2"
		}, {
			"Podcast Title" : "Hello World Podcast",
			"Website URL" : "https://wildermuth.com/hwpod",
			"Description" : "Not just another technical podcast. Shawn Wildermuth brings you his \"Hello World\" podcast where we learn about how your favorite developers tell their story of how they got started writing software!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-hello-world-podcast/id768018561?mt=2"
		}, {
			"Podcast Title" : "No Dogma Podcast",
			"Website URL" : "http://nodogmapodcast.bryanhogan.net/",
			"Description" : "Discussions on topics connected with software development; privacy, security, management, tools, techniques, skills, training, business",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/no-dogma-podcast/id912568441?mt=2",
			"Episodes John Was On" : "Episode 35, talking about my book Soft Skills\nhttp://nodogmapodcast.bryanhogan.net/35-john-sonmez-soft-skills/"
		}, {
			"Podcast Title" : "Software Engineering Radio",
			"Website URL" : "http://www.se-radio.net/",
			"Description" : "Software Engineering Radio is a podcast targeted at the professional software developer. The goal is to be a lasting educational resource, not a newscast. Every 10 days, a new episode is published that covers all topics software engineering. Episodes are either tutorials on a specific topic, or an interview with a well-known character from the software engineering world. All SE Radio episodes are original content — we do not record conferences or talks given in other venues. Each episode comprises two speakers to ensure a lively listening experience. SE Radio is an independent and non-commercial organization.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/software-engineering-radio/id120906714?mt=2",
			"Episodes John Was On" : "Episode 245, talking about marketing yourself and managing your career\nhttp://www.se-radio.net/2015/12/se-radio-episode-245-john-sonmez-on-marketing-yourself-and-managing-your-career/"
		}, {
			"Podcast Title" : "Eat Sleep Code Podcast",
			"Website URL" : "https://soundcloud.com/esc-podcast",
			"Description" : "On the show we’ll be talking to passionate people about a wide range of developer related topics. Part of the Telerik Developer Network , Eat Sleep Code is the Official Telerik Podcast. At Telerik we believe in giving back to the developer community and we do this by writing, speaking and staying in touch with the software development community.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/eat-sleep-code-podcast/id1015556393?mt=2",
			"Episodes John Was On" : "Talking about soft skills\nhttp://developer.telerik.com/topics/developer-soft-skills-with-john-sonmez/"
		}, {
			"Podcast Title" : "Complete Developer Podcast",
			"Website URL" : "http://completedeveloperpodcast.com/",
			"Description" : "There are plenty of podcasts out there about languages and coding. What we are doing with the Complete Developer Podcast is to cover the other areas of life. For example, our first episode is about talking with customers, bosses, and others that developers interact with who are not fellow developers.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/complete-developer-podcast/id1039210992?mt=2",
			"Episodes John Was On" : "Episode 60: Overcoming Social Awkwardness\nhttp://completedeveloperpodcast.com/episode-60/"
		}, {
			"Podcast Title" : "Software Engineering Daily",
			"Website URL" : "http://softwareengineeringdaily.com/",
			"Description" : "Software Engineering Daily features daily interviews about technical software topics.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/software-engineering-daily/id1019576853?mt=2"
		}, {
			"Podcast Title" : "Merge Conflict",
			"Website URL" : "http://www.mergeconflict.fm/",
			"Description" : "A weekly discussion on all things development, technology, & more. Available every Monday from 7am GMT.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/merge-conflict/id1133064277?mt=2"
		}, {
			"Podcast Title" : "The Five-Minute Geek Show",
			"Website URL" : "http://fiveminutegeekshow.com/",
			"Description" : "Matt Stauffer, unabashedly geeky, 5 minutes, twice a week. Frontend dev, backend dev, audio, design, podcasts--all fair game.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-five-minute-geek-show/id952727637?mt=2"
		}, {
			"Podcast Title" : "Full Stack Radio",
			"Website URL" : "http://fullstackradio.com/",
			"Description" : "A podcast for developers interested in building great software products. Every episode, Adam Wathan is joined by a guest to talk about everything from product design and user experience to unit testing and system administration.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/full-stack-radio/id931714873?mt=2"
		}, {
			"Podcast Title" : "The Bike Shed",
			"Website URL" : "http://bikeshed.fm/",
			"Description" : "On The Bike Shed, hosts Derek Prior, Sean Griffin, Laila Winner, and guests discuss their development experience and challenges with Ruby, Rails, JavaScript, and whatever else is drawing their attention, admiration, or ire this week.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-bike-shed/id935763119?mt=2"
		}, {
			"Podcast Title" : "The New Stack Makers",
			"Website URL" : "http://thenewstack.io/podcasts/makers/",
			"Description" : "A new interview each weekday, The New Stack's stream of featured speakers and interviews is all about the new software stacks that change the way we development and deploy software. For The New Stack Analysts podcast, please see https://soundcloud.com/thenewstack. For The New Stack @ Scale podcast, please see https://soundcloud.com/thenewstackatscale",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-new-stack-makers/id915443155?mt=2"
		}, {
			"Podcast Title" : "The New Stack Analysts",
			"Website URL" : "http://thenewstack.io/podcasts/analysts/",
			"Description" : "Alex Williams, founder of The New Stack, hosts \"The New Stack Analysts,\" a weekly round-table discussion covering The New Stack's latest data research, and topics related to app development and back-end services. For The New Stack @ Scale podcast, please see https://soundcloud.com/thenewstackatscale For The New Stack Makers stream, please see https://soundcloud.com/thenewstackmakers",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-new-stack-analysts/id915466036?mt=2"
		}, {
			"Podcast Title" : "Software Defined Talk",
			"Website URL" : "http://www.softwaredefinedtalk.com/",
			"Description" : "We discuss the fun, changing land of the software stack and how we're being defined by it.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/software-defined-talk/id893738521?mt=2"
		}, {
			"Podcast Title" : "The Changelog",
			"Website URL" : "https://changelog.com/podcast/",
			"Description" : "A weekly podcast that shines a spotlight on the technology and people of open source. It's about the code, the people, and the community.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-changelog/id341623264?mt=2"
		}, {
			"Podcast Title" : "The Dane and The Pain",
			"Website URL" : "http://www.daneandthepain.com/",
			"Description" : "Aussie Lars Klint (The Dane) and Alaskan Joel Jackson (The Pain) discuss the world of technology and how it relates to the real world. With a passion for all gadgets, nothing is sacred. Any topic is treated with the same level of curiosity, ignorance and blatant disregard for the Swedish.",
			"Subscribe URL" : "https://itunes.apple.com/ca/podcast/the-dane-and-the-pain/id918842620?mt=2"
		}, {
			"Podcast Title" : "Course Report",
			"Website URL" : "https://coursereport.com/",
			"Description" : "Podcast from coding bootcamp directory that includes interviews with developers attending various bootcamps, and monthly news roundups-- from new bootcamps to fundraising announcements, to controversy and interesting developer trends.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/course-report/id984646882?mt=2"
		}, {
			"Podcast Title" : "The Cynical Developer",
			"Website URL" : "http://cynicaldeveloper.com/",
			"Description" : "The podcast that helps you to understand why you should be using the latest and greatest in development technologies.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/the-cynical-developer/id1169160766?mt=2"
		}, {
			"Podcast Title" : "Hello Tech Pros",
			"Website URL" : "http://hellotechpros.com/",
			"Description" : "Why do many people in technology excel at technical skills but struggle with soft skills? Both are needed to truly exceed. This day-by-day ritual will help you get clear on your goals, develop more relationships, grow your career and launch your business. Join Chad and his featured guest as they take on each of these topics every week: Motivation Monday, Productivity Tuesday, Leadership Wednesday, Technology Thursday, People Friday, Entrepreneurship Saturday and Being Unplugged Sunday.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/hello-tech-pros-daily-soft/id1099720546?mt=2",
			"Episodes John Was On" : "Treat Your Career as a Business Even If You Have Only One Customer\nhttp://hellotechpros.com/john-sonmez-people/"
		}, {
			"Podcast Title" : "Learn to Code With Me",
			"Website URL" : "http://learntocodewith.me/podcast",
			"Description" : "The Learn to Code With Me podcast, created by Laurence Bradford, is for aspiring techies and self-taught coders looking to transition into the tech industry. Want actionable insights on how you can get paid for your coding skills? Then you're in the right place!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/learn-to-code-with-me/id1106620664?mt=2"
		}, {
			"Podcast Title" : "The Versioning Show",
			"Website URL" : "http://soundcloud.com/versioningshow",
			"Description" : "This is a show where we get together to discuss the industry of the web, from development to design, with some of the people making it happen today, and planning where it's headed in the next version.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-versioning-show/id1135300597?mt=2"
		}, {
			"Podcast Title" : "CodeChat",
			"Website URL" : "https://channel9.msdn.com/Shows/codechat",
			"Description" : "An informal, weekly chat about all things coding and software development. I'll be bringing in community developers from the Seattle area, folks from the Microsoft product groups, and anyone else with something interesting to discuss.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/codechat-mp4-channel-9/id897239000?mt=2"
		}, {
			"Podcast Title" : "User Error",
			"Website URL" : "http://www.jupiterbroadcasting.com/show/error/",
			"Description" : "Everyone makes mistakes, we just make show content out of them. Insightful yet irreverent and somewhat raw, User Error is a weekly talk show contemplating our own issues and those of our community.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/user-error-podcast/id1145648639?mt=2"
		}, {
			"Podcast Title" : "This Developer's Life",
			"Website URL" : "http://thisdeveloperslife.com/",
			"Description" : "A podcast about developers and their lives - bringing a human slant to the tech industry.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/this-developers-life/id389727545?mt=2"
		}, {
			"Podcast Title" : "NashDev",
			"Website URL" : "http://nashdevcast.com/",
			"Description" : "Software engineering news in the nashville developer community",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/nashdev-podcast/id1104853678?mt=2"
		}, {
			"Podcast Title" : "Greater Than Code",
			"Website URL" : "http://www.greaterthancode.com/",
			"Description" : "A podcast about humans and technology. Each episodes features a conversation with a developer and their own story to tell. Features a wide range of topics: from advice on technical interviews to sexuality in tech.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/greater-than-code/id1163023878?mt=2"
		}, {
			"Podcast Title" : "Toolsday",
			"Website URL" : "http://toolsday.io/",
			"Description" : "20 minutes of tech tool talk on Tuesdays at 2. Covers a different tech tool every week -- from Git to Gifv, Chrom DevTools to Webpack 2.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/toolsday/id1063765302?mt=2"
		}, {
			"Podcast Title" : "Upgrade",
			"Website URL" : "https://www.relay.fm/upgrade",
			"Description" : "Upgrade looks at how companies including Apple, Amazon and Google shape the technology in our lives and how people do creative work in the digital age. Hosted by Myke Hurley and Jason Snell.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/upgrade/id918152703?mt=2"
		}, {
			"Podcast Title" : "My Life For The Code",
			"Website URL" : "http://www.mylifeforthecode.com/",
			"Description" : "In this weekly podcast, Shawn Rakowski chats with everyday software developers about the work and projects they are passionate about with the hopes of inspiring other developers to find something they too can get excited about. You'll hear stories of their first experiences programming, the highs and lows they have had as a developer, and what they are excited about today. You'll also hear tips and tricks for making you an all around better software developer.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/my-life-for-the-code/id1013651522?mt=2"
		}, {
			"Podcast Title" : "TechSNAP",
			"Website URL" : "http://www.jupiterbroadcasting.com/",
			"Description" : "An in-depth analysis of tech issues and topics. Hosted by Chris Fisher and Allan Jude, with over 20+ years in the technology industry. Tune in and get engaged by deep critical analysis and conversation around technologies’ milestones.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/techsnap-mp3/id433059024?mt=2"
		}, {
			"Podcast Title" : "The Geek Whisperers",
			"Website URL" : "http://geek-whisperers.com/",
			"Description" : "The Geek Whisperers work every day with enterprise IT professionals. In Season 2 of the show, the grew centers on talking about careers: particularly about the career success of high tech leaders who have navigated the nonlinear career path. Listen, enjoy and please be sure to share. Join John Troyer, Amy Lewis, and Matthew Brender as they share their experiences, stories, and what's worked for them as they do their daily jobs as Geek Whisperers.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-geek-whisperers/id614174706?mt=2"
		}, {
			"Podcast Title" : "Magic Read Along",
			"Website URL" : "http://www.magicreadalong.com/",
			"Description" : "Follow along with Brian Lonsdorf and Hardy Jones as they explore the internet, life, and programming.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/magic-read-along/id1129866472?mt=2"
		}, {
			"Podcast Title" : "STP Radio",
			"Website URL" : "http://www.spreaker.com/show/stp-radio",
			"Description" : "STP Radio is brought to you from the community of Software Test Professionals to showcase contemporary software testing topics, techniques, tools, practices and thought leaders from the industry. More information can be found at: www.softwaretestpro.com.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/stp-radio/id858864268?mt=2"
		}, {
			"Podcast Title" : "Test and Code",
			"Website URL" : "http://testandcode.com/",
			"Description" : "How did you become a software developer/tester/engineer/lead, etc? Odds are we all are missing some important information to do our jobs most effectively. This podcast is an attempt to fill those education gaps. I focus on testing and process questions like “How do I know it works?”, “How do I effectively test?”, and the like. But really, anything in the software development realm is fair game.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/test-and-code/id1029487211?mt=2"
		}, {
			"Podcast Title" : "The Testing Show",
			"Website URL" : "http://thetestingshow.libsyn.com/podcast",
			"Description" : "The Testing Show - covering everything related to software testing. Our panel of software testing experts will break down and analyze new tools, methodologies, trends and more. With a new episode every two weeks, you'll be sure to get your testing fix.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-testing-show/id1094861077?mt=2"
		}, {
			"Podcast Title" : "Embedded E-cast",
			"Website URL" : "http://ecast.opensystemsmedia.com/",
			"Description" : "An E-cast is a live, single or multiple sponsor event used to educate engineers, programmers, and other industry professionals about a particular product, service, or technology. Each podcast consists of a 45-minute presentation and 15-minute interactive Q&A session. E-casts are moderated by a member of the OpenSystems Media editorial staff or a industry recognized guest moderator. Our E-casts are moderated to keep the event interesting, informative, and technically relevant.",
			"Subscribe URL" : "https://itunes.apple.com/de/podcast/embedded-e-cast/id133520387?l=en&mt=2"
		}, {
			"Podcast Title" : "Request For Commits",
			"Website URL" : "http://rfc.fm/",
			"Description" : "Exploring different perspectives in open source sustainability. It's about the human side of code. Hosts Nadia Eghbal and Mikeal Rogers dive deep into the trials and tribulations of being an open source maintainer, building communities, and navigating the business side of software. Common topics include software licensing, copyright, documentation, governance models, funding platforms such as Open Collective, Kickstarter, etc., measuring success, and more.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/request-for-commits/id1141345001?mt=2"
		}, {
			"Podcast Title" : "TestTalks | Automation Awesomeness | Helping YOU Succeed with Test Automation",
			"Website URL" : "http://www.joecolantonio.com/",
			"Description" : "Test Talks is a weekly podcast hosted by Joe Colantonio, which geeks out on all things software test automation. TestTalks covers news found in the testing space, reviews books about automation and speaks with some of the thought leaders in the test automation field. We’ll aim to interview some of today’s most successful and inspiring software engineers and test automation thought leaders.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/testtalks-automation-awesomeness-helping-you-succeed/id826722706?mt=2"
		}
	],
	".NET and Microsoft Related" : [{
			"Podcast Title" : ".NET Rocks",
			"Website URL" : "http://www.dotnetrocks.com/",
			"Description" : "An awesome and long running podcast by Carl Franklin and Richard Campbell.  It used to be primarily about .NET, but not it is much more diverse and covers a large variety of topics.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/net-rocks/id130068596?mt=2",
			"Episodes John Was On" : "Show 1346, Leading Your Career \nhttp://www.dotnetrocks.com/default.aspx?showNum=1346\nShow 1088, talking about working on your career and soft skills.\nhttp://www.dotnetrocks.com/default.aspx?showNum=1088\nShow 980, talking about Managing Your Career\nhttp://www.dotnetrocks.com/default.aspx?showNum=980\nShow 887, talking about Google’s Dart language.\nhttp://www.dotnetrocks.com/default.aspx?showNum=887"
		}, {
			"Podcast Title" : "CodingBlocks.NET",
			"Website URL" : "http://www.codingblocks.net/",
			"Description" : "The world of computer programming is vast in scope. There are literally thousands of topics to cover and no one person could ever reach them all. One of the goals of the Coding Blocks podcast is to introduce a number of these topics to the audience so they can learn during their commute or while cutting the grass. We will cover topics such as best programming practices, design patterns, coding for performance, object oriented coding, database design and implementation, tips, tricks and a whole lot of other things.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/coding-blocks-software-web/id769189585?mt=2"
		}, {
			"Podcast Title" : "Hanselminutes",
			"Website URL" : "http://hanselminutes.com/",
			"Description" : "Hanselminutes - Fresh Air for Developers is a weekly talk show that brings interesting people together to talk about the web, culture, education, technology and more. Hosted by Scott Hanselman, this show promises fresh ideas and great people.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/hanselminutes/id117488860?mt=2",
			"Episodes John Was On" : "Show 348 talking about ServiceStack\nhttp://hanselminutes.com/348/more-on-service-stack-with-john-sonmez\n322 talking about fitness\nhttp://hanselminutes.com/322/getting-fit-with-programmer-john-sonmez\n305 talking about Xamarin\nhttp://hanselminutes.com/305/monotouch-and-mono-for-android-with-trainer-john-sonmez"
		}, {
			"Podcast Title" : "Herding Code",
			"Website URL" : "http://herdingcode.com/",
			"Description" : "A weekly discussion featuring K. Scott Allen (odetocode.com), Kevin Dente, Scott Koon (lazycoder.com), and Jon Galloway.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/herding-code/id284067914?mt=2"
		}, {
			"Podcast Title" : "MS Dev Show",
			"Website URL" : "http://msdevshow.com/",
			"Description" : "THE podcast for Microsoft developers. Jason Young and Carl Schweitzer talk about the latest in developer news covering topics such as the Azure cloud, Windows, Windows Phone, Visual Studio, and cross-platform development using the Microsoft platform.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/ms-dev-show/id862879925?mt=2",
			"Episodes John Was On" : "Episode 44 talking about all the details software developers didn’t learn in school, creating DMZ in Azure, and the Joel Test for programmers\nhttp://msdevshow.com/2015/02/soft-skills-with-john-sonmez/"
		}, {
			"Podcast Title" : "Yet Another Podcast",
			"Website URL" : "http://jesseliberty.com/podcast/",
			"Description" : "Programmers talking with programmers about Windows and Best Practices, as well as all things Geek.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/yapcast-jesse-liberty/id393751871?mt=2",
			"Episodes John Was On" : "Show 113 talking about ServiceStack\nhttp://jesseliberty.com/2013/11/16/yet-another-podcast-113john-sonmezpluralsight-author-and-a-focus-on-servicestack/\nShow 145, talking about life and the pursuit of happiness\nhttp://jesseliberty.com/2015/12/29/yet-another-podcast-145-john-sonmez/"
		}, {
			"Podcast Title" : "Channel 9",
			"Website URL" : "https://channel9.msdn.com/",
			"Description" : "Channel 9 keeps you up to date with the latest news and behind the scenes info from Microsoft that developers love to keep up with. From LINQ to SilverLight – Watch videos and hear about all the cool technologies coming and the people behind them.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/channel-9/id73802611?mt=2"
		}, {
			"Podcast Title" : "RunAs Radio",
			"Website URL" : "http://www.runasradio.com/",
			"Description" : "RunAs Radio is a weekly Internet Audio Talk Show for IT Professionals working with Microsoft products.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/runas-radio/id253682066?mt=2"
		}, {
			"Podcast Title" : "DevRadio",
			"Website URL" : "https://channel9.msdn.com/Blogs/DevRadio",
			"Description" : "Microsoft's DevRadio is for developers created by developers. Community leaders, industry leaders, Microsoft insiders. We bring you the latest in software development news.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/devradio-audio-channel-9/id547317335?mt=2"
		}, {
			"Podcast Title" : "The Static Void Podcast",
			"Website URL" : "https://www.staticvoidpodcast.com/",
			"Description" : "Join Jess, Todd, and Chris as they do their best to keep up-to-date with what's going on in the software development world today. Who knows - maybe you'll learn a thing or two!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-static-void-podcast/id1042502752?mt=2"
		}, {
			"Podcast Title" : "Microsoft Mechanics (HD) - Channel 9",
			"Website URL" : "http://s.ch9.ms/Shows/Mechanics",
			"Description" : "The official show and video platform for our latest technology innovations, engineering commentary, and demos. Made just for tech enthusiasts and IT professionals. Once the popular Office Mechanics show, it has now expanded its coverage of your favorite technologies across Microsoft; including Office, Azure, Data Platform and Windows. We'll even bring you broader topics such as device innovation with Surface, machine learning, and predictive analytics. Subscribe and look for new shows weekly or as news breaks. Follow us on Twitter, Facebook, LinkedIn and YouTube.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/microsoft-mechanics-hd-channel-9/id890162329?mt=2"
		}
	],
	"Mobile Development" : [{
			"Podcast Title" : "Accidental Tech Podcast",
			"Website URL" : "http://atp.fm/",
			"Description" : "Three nerds discussing tech, Apple, programming, and loosely related matters.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/accidental-tech-podcast/id617416468?mt=2"
		}, {
			"Podcast Title" : "Android Developers Backstage",
			"Website URL" : "http://androidbackstage.blogspot.com/",
			"Description" : "Android Backstage, a podcast by and for Android developers. Hosted by developers from the Android engineering team, this show covers topics of interest to Android programmers, with in-depth discussions and interviews with engineers on the Android team at Google.",
			"Subscribe URL" : "http://feeds.feedburner.com/blogspot/AndroidDevelopersBackstage"
		}, {
			"Podcast Title" : "App Masters",
			"Website URL" : "http://www.appmasters.co/",
			"Description" : "Want to build a top 10 mobile app or game? Learn from the top mobile app developers in the space as they share tips and tricks on how they built their business. Topics range from mobile marketing to mobile game development to mobile services. If you want to succeed in the mobile space, this podcast delivers invaluable lessons from successful mobile entrepreneurs.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/appmasters.co-app-marketing/id643216602?mt=2",
			"Episodes John Was On" : "Talking about how to market yourself\nhttp://www.appmasters.co/simple-programmer-john-sonmez/\nEpisode 24 talking about how finishing my first mobile app was a turning point in my career\nhttp://www.appbizdev.com/2015/01/episode-24-big-finish.html"
		}, {
			"Podcast Title" : "Core Intuition",
			"Website URL" : "http://www.coreint.org/",
			"Description" : "Daniel Jalkut and Manton Reece discuss Mac programming, independent development, Apple news, and more.",
			"Subscribe URL" : "https://itunes.apple.com/podcast/core-intuition/id281777685?mt=2"
		}, {
			"Podcast Title" : "Under the Radar",
			"Website URL" : "http://developingperspective.com/",
			"Description" : "From development and design to marketing and support, Under the Radar is all about independent app development. It's never longer than 30 minutes. Hosted by David Smith and Marco Arment.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/under-the-radar/id1055685246?mt=2"
		}, {
			"Podcast Title" : "Gone Mobile",
			"Website URL" : "http://gonemobile.io/",
			"Description" : "Gone Mobile is a podcast discussing the latest in mobile development, with a healthy bias towards Xamarin technologies. The podcast covers in-depth topics with guests ranging from Android, iOS, Windows Phone & Store development to mobile marketing and design, as well as other mobile or not so mobile related technologies.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/gone-mobile-podcast/id698794070?mt=2",
			"Episodes John Was On" : "Episode 9 talking about how to market yourself and how mobile development can help you do it\nhttp://gonemobile.io/blog/e0009-marketing-yourself-with-john-sonmez/"
		}, {
			"Podcast Title" : "iPhreaks",
			"Website URL" : "https://devchat.tv/iphreaks",
			"Description" : "The iPhreaks Show is a weekly group discussion about iOS development and related technology by development veterans. We discuss Apple, tools, practices, and code.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-iphreaks-show/id634022060?mt=2",
			"Episodes John Was On" : "Episode 91 talking about Soft Skills and marketing yourself as a software developer\nhttp://devchat.tv/iphreaks/091-ips-soft-skills-and-marketing-yourself-as-a-software-developer-with-john-sonmez"
		}, {
			"Podcast Title" : "React Native Radio",
			"Website URL" : "https://devchat.tv/react-native-radio",
			"Description" : "React Native Radio is a weekly discussion of the tools, techniques, and technologies used to build mobile applications with JavaScript and React done by developers regularly using React Native.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/react-native-radio/id1058647602?mt=2"
		}, {
			"Podcast Title" : "Xamarin Podcast",
			"Website URL" : "https://soundcloud.com/xamarin-podcast",
			"Description" : "The home of the official Xamarin Podcast, bringing mobile developers the latest news and information about Xamarin and mobile development. Views and opinions expressed in these podcasts do not reflect the views, opinions, or policies of Xamarin Inc.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/xamarin-podcast/id691368176?mt=2"
		}, {
			"Podcast Title" : "Fragmented",
			"Website URL" : "http://fragmentedpodcast.com/",
			"Description" : "The Fragmented Podcast is a podcast for Android Developers hosted by Donn Felker and Kaushik Gopal. Our goal is to help you become a better Android Developer. We chat about topics such as Testing, Dependency Injection, Android Patterns and Practices, useful libraries and much more. We will also be interviewing some of the top Android Developers out there.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/fragmented/id968779958?mt=2"
		}, {
			"Podcast Title" : "Release Notes",
			"Website URL" : "https://releasenotes.tv/",
			"Description" : "Release Notes is a weekly podcast about the business of Mac and iOS indie software development. We discuss inspiration, design, trends, and tools — everything but the code. Each week, we cover topics for the new or curious independent developer looking to make his or her way in the iOS and Mac ecosystem. Tips and tricks, success stories as well as failures.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/release-notes/id650358643?mt=2"
		}, {
			"Podcast Title" : "iOhYes",
			"Website URL" : "http://5by5.tv/iohyes",
			"Description" : "A podcast by iOS developers for iOS developers, delivering news, tips, and rants for professional iOS/Mac developers, with something for enterprise and indie developers alike.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/build-phase/id681232605?mt=2"
		}, {
			"Podcast Title" : "Build Phase",
			"Website URL" : "http://buildphase.fm/",
			"Description" : "Build Phase is a weekly technical podcast discussing iOS development and design. Hosted by iOS developers Mark Adams, Jack Nutting, and Gordon Fontenot.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/build-phase/id681232605?mt=2"
		}, {
			"Podcast Title" : "iOS Dev Break",
			"Website URL" : "http://iosdevbreak.libsyn.com/podcast",
			"Description" : "iOS Dev Break: 15 minutes of current events, tips, and advice for iOS Developers! Including, but not limited to, discussions of Swift, iOS, watchOS, and tvOS development.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/ios-dev-break/id1157188242"
		}, {
			"Podcast Title" : "The Context #androiddev",
			"Website URL" : "https://github.com/artem-zinnatullin/TheContext-Podcast",
			"Description" : "The Context is a podcast about Android Development. Topics covered include reactive programming, architecture and design. ",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-context-androiddev/id1081726814?mt=2"
		}, {
			"Podcast Title" : "More Than Just Code",
			"Website URL" : "http://www.mtjc.fm/",
			"Description" : "More Than Just Code (MTJC) is a show about mobile development, for developers in a panel discussion. Each show we discuss topical issues to find out what developers they are following, what their apps are about, what they are using to create their apps and what advice they have for other developers or those looking to become a developer. Plus we have news, notes and tech tips for developers.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/more-than-just-code-podcast-podcast-about-ios-os-x/id906987516?mt=2"
		}, {
			"Podcast Title" : "SwiftCoders: Weekly Interviews with Swift Developers",
			"Website URL" : "http://swiftcoders.podbean.com/",
			"Description" : "Weekly interviews with Swift developers about their experience with Apple’s new open source programming language. Hear their stories, learn tips and tricks, and leave empowered.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/swiftcoders-weekly-interviews-with-swift-developers/id1082937962?mt=2"
		}
	],
	"JavaScript and Web" : [{
			"Podcast Title" : "Adventures in Angular",
			"Website URL" : "https://devchat.tv/adventures-in-angular",
			"Description" : "Adventures in Angular is a weekly podcast about developments in the Angular community, tools, techniques, and ecosystem.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/adventures-in-angular/id907361052?mt=2"
		}, {
			"Podcast Title" : "The Back to Front Show",
			"Website URL" : "http://backtofrontshow.com/",
			"Description" : "The Back to Front show was started in 2013 by web industry veterans Keir Whitaker and Kieran Masterton. Over the first 40 episodes they have discussed everything from web design and development to startups and dog related tech. Today the focus has shifted and includes topics including remote working, working in the web industry, productivity, hipster beards and much more. Released irregularly but always produced with passion The Back to Front Show runs for around 40 minutes per episode and comes to you from the beautiful West Country in the UK. Thanks for listening.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/the-back-to-front-show/id594631752?mt=2"
		}, {
			"Podcast Title" : "The Big Web Show",
			"Website URL" : "http://5by5.tv/bigwebshow",
			"Description" : "The award winning Big Web Show features special guests and topics like web publishing, art direction, content strategy, typography, web technology, and more. It’s everything web that matters.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-big-web-show/id370445683?mt=2"
		}, {
			"Podcast Title" : "Boagworld Show ",
			"Website URL" : "https://boagworld.com/show",
			"Description" : "Boagworld is a podcast about digital strategy, management and user experience. It offers practical advice, news, tools, review and interviews with leading figures in the web design community. Covering everything from usability and design to marketing and strategy, this show has something for everything. This award winning podcast is the longest running web design podcast with over 380 episodes.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-boagworld-ux-show/id411449225?mt=2"
		}, {
			"Podcast Title" : "JavaScript Jabber",
			"Website URL" : "https://devchat.tv/js-jabber/",
			"Description" : "A weekly podcast about JavaScript, including Node.js, front-end technologies, careers, teams and more.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/javascript-jabber/id496893300?mt=2",
			"Episodes John Was On" : "Episode 156 talking about Soft Skills and marketing yourself as a software developer\nhttp://devchat.tv/js-jabber/156-jsj-soft-skills-and-marketing-yourself-as-a-software-developer-with-john-sonmez\n233 JSJ Google Chrome Extensions with John Sonmez\nhttps://devchat.tv/js-jabber/233-jsj-google-chrome-extensions-with-john-sonmez"
		}, {
			"Podcast Title" : "NodeUp",
			"Website URL" : "http://nodeup.com/",
			"Description" : "NodeUp is a podcast about Node.js",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/nodeup/id447667314?mt=2"
		}, {
			"Podcast Title" : "Shop Talk",
			"Website URL" : "http://shoptalkshow.com/",
			"Description" : "ShopTalk is a podcast about front end web design, development and UX. Each week Chris Coyier and Dave Rupert are joined by a special guest to talk shop and answer listener submitted questions.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/shoptalk/id493890455?mt=2"
		}, {
			"Podcast Title" : "Start Here FM",
			"Website URL" : "http://dain.io/startherefm/",
			"Description" : "An informative and up-to-date podcast on creating a business with Web Development.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/start-here-web-development/id898026456?mt=2"
		}, {
			"Podcast Title" : "The Web Platform Podcast",
			"Website URL" : "http://thewebplatform.libsyn.com/webpage",
			"Description" : "The Web Platform Podcast is a developer discussion that dives deep into ‘all things’ web. We discuss everything from developing for mobile to building HDTV software. From wearables & robotics to user experience & mentoring, we bring to our listeners everything related to building products & services for The Web Platform of today, tomorrow, and beyond.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-web-platform-podcast/id899384794?mt=2"
		}, {
			"Podcast Title" : "Relative Paths",
			"Website URL" : "http://relativepaths.uk/",
			"Description" : "This is a UK based podcast for web industry types.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/relative-paths-web-development/id914858338?mt=2"
		}, {
			"Podcast Title" : "Design vs Dev",
			"Website URL" : "http://agileleague.com/",
			"Description" : "A podcast about web development from the different perspectives of designers and developers. We help developers be better at design, and designers be better at development. Design vs Dev is brought to you by The Agile League, a web development agency based in Atlanta, GA specializing in Ruby on Rails, web design, and Ember.js",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/design-vs-dev/id910008025?mt=2"
		}, {
			"Podcast Title" : "Angular Air",
			"Website URL" : "http://angularair.podbean.com/",
			"Description" : "Angular Air is a video podcast all about AngularJS and Angular 2 hosted by AngularClass",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/angular-air/id940806858?mt=2"
		}, {
			"Podcast Title" : "A Responsive Web Design Podcast",
			"Website URL" : "https://responsivewebdesign.com/podcast/",
			"Description" : "A podcast from Karen McGrane and Ethan Marcotte, who interview people who make responsive designs happen.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/responsive-web-design-podcast/id910013523?mt=2"
		}, {
			"Podcast Title" : "Front End Happy Hour",
			"Website URL" : "http://frontendhappyhour.com/",
			"Description" : "A podcast featuring panelists of engineers from Netflix, Evernote & LinkedIn talking over drinks about all things Front End development.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/front-end-happy-hour/id1089047924?mt=2"
		}, {
			"Podcast Title" : "Modern Web",
			"Website URL" : "http://modernweb.podbean.com/",
			"Description" : "Modern Web is a podcast that covers the latest news on topics such as EmberJS, ReactJS, AngularJS, ES2015, RxJS, Functional Reactive Programming, and more.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/modern-web/id1084236187?mt=2"
		}, {
			"Podcast Title" : "Start Here: Web Development",
			"Website URL" : "http://starthere.fm/webdev",
			"Description" : "Do you want to get your first job as a web developer, or level up in your web dev career?? Well, StartHere: Web Development is the show for you! Dain Miller is your new mentor as he shares his industry experience, insight, and resources to help get you from knowing nothing to becoming a full-time web developer. Everyone starts somewhere and you’re starting here.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/start-here-web-development/id898026456?mt=2"
		}, {
			"Podcast Title" : "CSS-Tricks Screencasts",
			"Website URL" : "http://css-tricks.com/video-screencasts/",
			"Description" : "CSS-Tricks Screencasts is focused on showing you tips, tricks, techniques about web design.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/css-tricks-screencasts/id273881728?mt=2"
		}, {
			"Podcast Title" : "Front-end Five",
			"Website URL" : "https://frontendfive.codeschool.com/",
			"Description" : "Front-end Five is a weekly podcast covering all of your front-end news in just 5 minutes. In each episode we talk about HTML, CSS, and JavaScript, as well as other items of interest and community events. It's great for both developers and designers alike.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/front-end-five/id1003995196?mt=2"
		}, {
			"Podcast Title" : "Coder Catchup",
			"Website URL" : "http://codercatchup.com/",
			"Description" : "Catch up with various web developers and web designers with discussion revolving around a variety of web development and design issues.",
			"Subscribe URL" : "https://itunes.apple.com/gb/podcast/coder-catchup/id965517704?mt=2"
		}, {
			"Podcast Title" : "Style Guide",
			"Website URL" : "http://styleguides.io/podcast",
			"Description" : "A small batch podcast hosted by Anna Debenham and Brad Frost, dedicated to talking about style guides, pattern libraries and building effective interface systems.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/style-guide-podcast/id960374773?mt=2"
		}, {
			"Podcast Title" : "North Meets South Web Podcast",
			"Website URL" : "http://northmeetssouth.audio/",
			"Description" : "Jacob Bennett and Michael Dyrynda conquer a 14.5 hour time difference to talk about life as web developers",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/north-meets-south-web-podcast/id1123508667?mt=2"
		}, {
			"Podcast Title" : "JS Party",
			"Website URL" : "http://jsparty.fm/",
			"Description" : "A community celebration of JavaScript and the web. This show records LIVE on Fridays at 3pm US/Eastern time. Panelists include Mikeal Rogers, Rachel White, and Alex Sexton. Topics discussed include the web platform (Chrome, Safari, Edge, Firefox, Brave, etc), front-end frameworks (React, Ember, Angular, Vue, etc), Node.js, web animation, SVG, robotics, IoT, and much more. If JavaScript and/or the web touch your life, this show’s for you.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/js-party/id1209616598?mt=2"
		}
	],
	"Game Development" : [{
			"Podcast Title" : "The Debug Log",
			"Website URL" : "http://thedebuglog.com/",
			"Description" : "A podcast about game development. This is not your typical developer podcast. The Debug Log balances in-depth discussions and interviews with a casual and wry sense of humor. Join them each week as they deep dive into the evolving world of game development.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-debug-log/id1019074514?mt=2"
		}, {
			"Podcast Title" : "Game Dev Unchained",
			"Website URL" : "http://www.gamedevunchained.com/",
			"Description" : "Game industry veterans Brandon Pham and Larry Charles invite you to join us for our in depth, raw and unadulterated podcast about video game development.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/game-dev-unchained/id1043547750?mt=2"
		}, {
			"Podcast Title" : "Indie Dev Podcast",
			"Website URL" : "http://indiedevpodcast.podomatic.com/",
			"Description" : "Each episode I interview and profile various independent game developers, so that we can get a peek behind the curtain and see how the magic is made.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/indie-dev-podcast/id746942884?mt=2"
		}, {
			"Podcast Title" : "gamkedo.community",
			"Website URL" : "http://gamedevslikeyou.libsyn.com/podcast",
			"Description" : "The mission of Gamkedo Community is to share the personal stories and ways of thinking from developers with a wide range of experience levels, to convey a broader picture of what making games is like. ",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/gamkedo.community/id1006574766?mt=2"
		}, {
			"Podcast Title" : "JustForward.co",
			"Website URL" : "http://justforward.co/",
			"Description" : "JustForward is a podcast created for you, the Appreneur, Indie Game Developer, Growth Hacker or App Marketer. It is relevant for both iOS and Android platforms. Are you struggling with increasing the quality of your games? Make the most of Game Development! The goal of this podcast is to make the complex nature of game development both clean and simple. Podcasts cover key topics of mobile gamedev for those who just started and for professionals: gamedev from scratch, game reskinning, game templates, game source codes, app store optimization (ASO), mobile SEO, game promotion, game advertising and app monetization. Subscribe and receive growth hacking tools and tips. Also visit our website JustForward.co and Like us on facebook.com/justforward.co",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/justforward-co-gamedev-indiedev-growth-hacking-podcast/id971741920?mt=2"
		}
	],
	"Freelancing" : [{
			"Podcast Title" : "Freelance Transformation ",
			"Website URL" : "http://www.freelancetransformation.com/",
			"Description" : "reelance Transformation is a podcast all about building a freelance business that creates the lifestyle that you desire, not the other way around. If you are looking to find great clients, do your best work, earn higher rates, and enjoy getting out of bed in the morning, this podcast is for you, the freelancer, the consultant, the agency owner, the creative. Matt Inglot, your host, delivers a new episode every Monday. Visit www.freelancetransformation.com for show notes and the Freelance Transformation newsletter.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/freelance-transformation-find/id981437421?mt=2",
			"Episodes John Was On" : "Episode 7, talking about how to be productive, successful and happy\nhttp://www.freelancetransformation.com/blog/how-to-be-productive-successful-and-happy-with-john-sonmez"
		}, {
			"Podcast Title" : "The Freelancers’ Show",
			"Website URL" : "https://www.freelancersshow.com/",
			"Description" : "Weekly discussion by freelancers and professionals about running a business, finding clients, marketing, and lifestyle related to being a freelancer.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-freelancers-show/id715647197?mt=2",
			"Episodes John Was On" : "Show 112 talking about How To Market Yourself as a Software Developer\nhttp://www.freelancersshow.com/the-freelancers-show-112-how-to-market-yourself-as-a-software-developer-with-john-sonmez/#comments"
		}, {
			"Podcast Title" : "Freelance Blend Podcast",
			"Website URL" : "http://www.freelanceblend.com/",
			"Description" : "\"The podcast for freelancers, by freelancers.\" Join host Marv de Leon -- business coach, author, speaker, digital strategist and champion of the Filipino Freelancer -- as he interviews influential freelancers and rock star entrepreneurs from across the globe as well as ordinary people like you and me who have shifted to freelancing and changed their lives The show has featured Vince Golangco of When In Manila, Anton Diaz of Our Awesome Planet, Jaymie Pizarro of The Bull Runner blog, Mike Grogan of Best Of You Podcast, Ginger Arboleda of Manila Workshops and Showbiz Bro of Machong Chismisan Podcast and a lot more. Listen as they reveal their tactics, share their light bulb moments and talk about the failures and hurdles they overcame to become invincible entrepreneurs as they are. If they can do it, so can you! The Freelance Blend Podcast is inspired by the shows Smart Passive Income Podcast by Pat Flynn, Solopreneur Hour and EO Fire by John Lee Dumas but with Marv's own unique twist.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/freelance-blend-podcast/id789191884?mt=2"
		}
	],
	"Entrepreneurial" : [{
			"Podcast Title" : "Entreprogrammers: The Podcast For Developerneurs",
			"Website URL" : "http://entreprogrammers.com/",
			"Description" : "Get a fly-on-the-wall perspective from 4 developers turned entrepreneurs, as they struggle with the business and learn lessons the hard way. This is the weekly mastermind group of the entreprogrammers - a no holds barred, unedited look at what it really takes to be an entrepreneur.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/entreprogrammers-podcast/id875119779?mt=2",
			"Episodes John Was On" : "Just about all of them!"
		}, {
			"Podcast Title" : "Bootstrapped",
			"Website URL" : "http://bootstrapped.fm/",
			"Description" : "Both Ian and Andrey are experience startup founders, both have had major blows and successes in their career. You can learn alot listening to them. Just note, Andrey is the hyper one so expect him to talk alot more than Ian Landsman.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/bootstrapped/id623143926?mt=2"
		}, {
			"Podcast Title" : "Bootstrapped With Kids",
			"Website URL" : "http://www.bootstrappedwithkids.com/",
			"Description" : "Brecht and Scott share their challenges and learnings as they build and launch boot strapped SaaS applications.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/bootstrapped-kids-podcast/id602804013?mt=2"
		}, {
			"Podcast Title" : "Techzing Tech Podcast",
			"Website URL" : "http://techzinglive.com/",
			"Description" : "TechZing is an informal chat show hosted by Justin Vincent & Jason Roberts. We release two shows per week. Midweek Interview Show – We interview people that we find interesting such as John C Dvorak, Peldi from Balsamiq, Pete Michaud etc. Weekend Discussion Show – We have a ‘no agenda’ style discussion ruminating on tech, startups and other HN-like topics, we’ll even on occasion take a risk and venture into the unknown. We also talk about the progression of our businesses Pluggio & AppIgnite.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/techzing-tech-podcast/id318567721?mt=2"
		}, {
			"Podcast Title" : "Bootstrapped Web",
			"Website URL" : "http://bootstrappedweb.com/",
			"Description" : "Bootstrapped Web is for entrepreneurs bootstrapping their startups, who believe that the best way to get to where we're going is to learn by doing. Conversations, case studies, and interviews with entrepreneurs who are building profitable businesses online. Let's do this.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/bootstrapped-web-for-entrepreneurs/id657005810?mt=2"
		}, {
			"Podcast Title" : "Product People",
			"Website URL" : "http://www.productpeople.tv/",
			"Description" : "A podcast focused on great products and the people who make them",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/product-people/id585390927?mt=2"
		}, {
			"Podcast Title" : "Rocketship.fm",
			"Website URL" : "http://rocketship.fm/",
			"Description" : "Business Explored. The podcast that inspires tens of thousands of entrepreneurs each week. Join us as we dive into everything from funding to growth, culture to sales and everything in between. New interview every Sunday and a full episode every Wednesday.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/rocketship.fm-startup-business/id808014240?mt=2",
			"Episodes John Was On" : "Why You Need to Develop Your Non-Technical Skills\nhttp://rocketship.fm/episodes/ep-140-john-sonmez/"
		}, {
			"Podcast Title" : "Giant Robots Smashing Into Other Giant Robot",
			"Website URL" : "http://giantrobots.fm/",
			"Description" : "GRSIOGR is a weekly podcast from thoughtbot discussing the business of great software products. Hosted by Ben Orenstein, we delve deep behind the scenes of thoughtbot's SaaS products. Ben is often joined by fellow developers and entrepreneurs.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/giant-robots-smashing-into/id535121941?mt=2"
		}, {
			"Podcast Title" : "Startups For The Rest of Us",
			"Website URL" : "http://www.startupsfortherestofus.com/",
			"Description" : "Welcome to Startups for the Rest of Us, the podcast that helps developers, designers and entrepreneurs be awesome at launching software products. Whether you’ve built your first product or are just thinking about it.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/startups-for-the-rest-of-us/id366931951?mt=2"
		}, {
			"Podcast Title" : "Entrepreneur on Fire",
			"Website URL" : "http://www.eofire.com/",
			"Description" : "Awarded 'Best of iTunes', EOFire is a 7-day a week Podcast where John Lee Dumas chats with todays most successful Entrepreneurs. Pat Flynn, Seth Godin, Tim Ferriss, Tony Robbins and Gary Vaynerchuk are just 5 of the over 1400 interviews to date. EOFire was created for YOU, the Entrepreneur, Side-Preneur, Solo-Preneur and Small Business Owner. If you're looking for ACTIONABLE advice during your daily commute, workout, or ‘me’ time, JLD brings the HEAT. Each episode details the journey of a successful Entrepreneur who shares their WORST Entrepreneurial moment and lessons learned, an AH-HA moment and how they turned that idea into success, and much more. Each episode ends with THE LIGHTNING ROUND where JLD extracts golden nuggets, Internet resources and action steps for you, FIRE NATION!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/eofire-entrepreneur-on-fire/id564001633?mt=2",
			"Episodes John Was On" : "Episode 1168, talking about how developers can market themselves\nhttp://www.eofire.com/podcast/johnsonmez/"
		}, {
			"Podcast Title" : "CodePen Radio",
			"Website URL" : "https://blog.codepen.io/",
			"Description" : "Chris Coyier, Alex Vazquez, and Tim Sabat, the co-founders of CodePen talk about the ins and outs of running a web software business. ",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/codepen-radio/id824437159?mt=2"
		}, {
			"Podcast Title" : "App Guy",
			"Website URL" : "http://www.theappguy.co/",
			"Description" : "Paul Kemp, host of The App Guy Podcast Creates Inspiring Founder Stories, Growth Hacking, Funding, Getting Beta Testers, Big Data, Lifestyle, Startups",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/app-guy/id771670010?mt=2"
		}, {
			"Podcast Title" : "Bluecloud Podcast: Build an App Business",
			"Website URL" : "https://www.bluecloudsolutions.com/",
			"Description" : "Carter Thomas of the Bluecloud Blog reveals the best way for the average person to build a successful app business. He has personally built a six-figure income app business, which has allowed him to travel and pursue his passions. A common misconception is that you need to be a developer or know how to code, to build an app. This is simply not true. By using app templates and existing source code, anyone can leverage these blueprints to create their own apps. Carter teaches you how to turn your idea into a successful product, app marketing, outsourcing, App Store Optimization (ASO), scaling your business, and much more.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/bluecloud-podcast-build-app-business-app-marketing/id1025182869?mt=2"
		}, {
			"Podcast Title" : "Rogue Startups",
			"Website URL" : "https://roguestartups.com/",
			"Description" : "The Rogue Startups podcast features two bootstrapped startup founders as they grow their businesses. We feature experts in the fields of sales, marketing, and product development to hear how they're growth hacking their productized services, WordPress plugins, and SaaS products. If you're on the journey of an entrepreneur then tune and hear how we're tackling some of the same obstacles you may be facing, and how we're winning in the game of business. Listeners of Startups for the Rest of Us, Mixergy, Zero to Scale, Bootstrapped Web, The Startup Chat, and Rhodium Podcast will love checking out our show.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/rogue-startups-podcast/id954938779?mt=2"
		}, {
			"Podcast Title" : "Global Product Management Talk",
			"Website URL" : "http://www.blogtalkradio.com/prodmgmttalk",
			"Description" : "#ProdMgmtTalk Professionals forwarding the movement for product excellence by design. Discussions about the art, craft and discipline required for products that contribute value. All aspects of customer development, user experience, product innovation, design, development, marketing and scaling. @ProdMgmtTalk Founded by @CindyFSolomon talking with thought leaders from Silicon Valley and beyond. @StartupProduct @ProductSummit Syndicating The Everyday Innovator with Chad McAllister.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/global-product-management-talk/id464701967?mt=2"
		}, {
			"Podcast Title" : "This is Product Management",
			"Website URL" : "http://www.thisisproductmanagement.com/",
			"Description" : "This is Product Management interviews brilliant minds across numerous disciplines that fuel modern product teams. From design to statistics, we've got you covered.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/this-is-product-management/id975284403?mt=2"
		}, {
			"Podcast Title" : "Tropical MBA – Location Independent Entrepreneurship",
			"Website URL" : "http://www.tropicalmba.com/",
			"Description" : "Dan Andrews and Ian Schoen share the stories of entrepreneurs who are building businesses and are in it for more than bottom line profits. TMBA gets published every Thursday morning. If you have a story you’d like us to cover on our show, contact our producer Jane@TropicalMBA.com or to leave us a voice message TropicalMBA.com/Voicemail",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/tropical-mba-location-independent-entrepreneurship/id325757845?mt=2"
		}, {
			"Podcast Title" : "This Week in Startups",
			"Website URL" : "http://thisweekinstartups.com/",
			"Description" : "Jason Calacanis and a rotating group of guest experts bring you this weekly take on the best, worst, most outrageous and interesting stories from the world of Web companies. Calacanis, a podcasting pioneer, gives you an insider's look at what's happening in the tech industry with his trademark blunt style and good humor. Looking to start your own company? Need strategies for improving your business or motivating your team? Just want to catch up on what's happening in Silicon Valley and beyond? Your journey begins here.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/this-week-in-startups-audio/id315114957?mt=2"
		}, {
			"Podcast Title" : "Mixergy - Startup Stories with 1000+ entrepreneurs and businesses",
			"Website URL" : "https://mixergy.com/",
			"Description" : "Mixergy.com \"Learn from Proven Entrepreneurs.\" In over 1,000 interviews, Andrew Warner asks uncomfortable questions to dig deep into the success and failures of the most successful business founders and thought leaders. The ideas and stories are so powerful that hearing them will change you.. If you are an ambitious entrepreneur crafting your next upstart or startup, there is no greater \"street smarts\" education than Mixergy. Don't miss out! 1) Subscribe to this podcast. 2) Turn on automatic downloads. 3) Enjoy every new interview for FREE. 4) Go to http://MixergyPremium.com and unlock the full back catalog of audio & video interviews, PLUS over 200 cheatsheets AND over 200 exclusive courses taught by real experts on topics like \"Mobile App Design,\" \"Preselling,\" \"How to have a profitable launch,\" \"Affiliate Marketing,\" \"How to Raise $1 Million from Investors.\" Sound good? \"In my 20s, with no outside funding, I co-founded a business that reached $30+ million in annual sales. Mixergy is the source I wish I had.\" - Andrew Warner, Founder of Mixergy.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/mixergy-startup-stories-1000-entrepreneurs-businesses/id348690336?mt=2"
		}, {
			"Podcast Title" : "Starting from Nothing",
			"Website URL" : "http://www.thefoundation.com/",
			"Description" : "How do you start a business when you have no money? No experience? No credibility? Or even no idea? This podcast will show you how. Every week successful entrepreneurs share the strategies of how they built their businesses entirely from scratch. No silver spoons. No magic bullets. No monkey business. Just hustling and using strategies that work. And the best part? For each episode we create a custom Action Guide so you know EXACTLY what action steps to take when you're done listening. You can download each Action Guide for free at www.thefoundationpodcast.com.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/starting-from-nothing-foundation-podcast-building-your/id659981522?mt=2"
		}, {
			"Podcast Title" : "The Smart Passive Income Online Business and Blogging Podcast",
			"Website URL" : "https://www.smartpassiveincome.com/",
			"Description" : "Pat Flynn from The Smart Passive Income Blog reveals all of his online business and blogging strategies, income sources and killer marketing tips and tricks so you can be ahead of the curve with your online business or blog. Discover how you can create multiple passive income streams that work for you so that you can have the time and freedom to do what you love, whether it's traveling the world, or just living comfortably at home. Although Pat confesses he is not a millionaire, he's been supporting his family 100% with passive income generated online, easily earning a six-figure salary while working only a few hours a week. Automation, outsourcing, crowdsourcing, search engine optimization, building authority and trust, niche sites, social media, Facebook, Twitter, YouTube, Podcasting, eBooks, online courses, affiliate marketing, getting things done and everything that works (and doesn't work) to help you better understand how to crush it with your online business.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/smart-passive-income-online-business-blogging-podcast/id383084001?mt=2"
		}, {
			"Podcast Title" : "Online Marketing Made Easy with Amy Porterfield",
			"Website URL" : "http://www.amyporterfield.com/",
			"Description" : "How do I start an online business? Grow my email list to thousands of subscribers? Sell more and grow faster? These are just some of the big questions that leading online marketing strategist, Amy Porterfield, digs into on the top-ranked Online Marketing Made Easy Podcast. Featuring insights from A-List online marketing experts (Russell Brunson, John Lee Dumas, Rick Mulready, Marie Forleo, etc.) as well as mini marketing masterclasses and step-by-step guides, each episode is designed to help you take immediate action on the most important strategies for starting, scaling and automating your online business. Amy’s specialty is getting into the online trenches with you. Thinking about creating an online course? Want to promote with webinars? Need help with your Facebook ads? Discover why hundreds of thousands of online business owners turn to Amy Porterfield to generate more profits and to make sense of the online marketing space, implement the strategies that really get results, and turn that side hustle into a business that lasts.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/online-marketing-made-easy-with-amy-porterfield/id594703545?mt=2"
		}
	],
	"Python" : [{
			"Podcast Title" : "Talk Python To Me",
			"Website URL" : "https://talkpython.fm/",
			"Description" : "Talk Python to Me is a weekly podcast hosted by Michael Kennedy. The show covers a wide array of Python topics as well as many related topics (e.g. MongoDB, AngularJS, DevOps).The format is a casual 45 minute conversation with industry experts.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/talk-python-to-me-python-conversations/id979020229?mt=2"
		}, {
			"Podcast Title" : "Podcast.__init__",
			"Website URL" : "http://pythonpodcast.com/",
			"Description" : "This is a long form podcast about Python and the people who make it great. We conduct interviews about projects and topics that are of particular interest to people in the Python community.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/podcast.-init-python-people/id981834425?mt=2",
			"Episodes John Was On" : "Episode 71, Soft Skills: The software developer's life manual\nhttps://talkpython.fm/episodes/show/71/soft-skills-the-software-developer-s-life-manual"
		}, {
			"Podcast Title" : "Test & Code",
			"Website URL" : "http://pythontesting.net/",
			"Description" : "A podcast about Software Development, Software Testing, and Python.\nHow did you become a software developer/tester/engineer/lead, etc?\nOdds are we all are missing some important information to do our jobs most effectively.\nThis podcast is an attempt to fill those education gaps.\nI focus on testing and process questions like “How do I know it works?”, “How do I effectively test?”, and the like.\nBut really, anything in the software development realm is fair game.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/test-and-code/id1029487211?mt=2"
		}, {
			"Podcast Title" : "Python Bytes",
			"Website URL" : "http://pythonbytes.fm/",
			"Description" : "Python Bytes is a semi weekly podcast hosted by Michael Kennedy and Brian Okken. The show is a short discussion on the headlines and noteworthy news in the Python, developer, and data science space.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/python-bytes/id1173690032?mt=2"
		}
	],
	"PHP" : [{
			"Podcast Title" : "/dev/hell",
			"Website URL" : "http://devhell.info/",
			"Description" : "The Development Hell Podcast. A web development podcast mostly focused on PHP development with some really great discussions.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/dev-hell/id489840699?mt=2"
		}, {
			"Podcast Title" : "The PHP Roundtable",
			"Website URL" : "https://www.phproundtable.com/",
			"Description" : "The PHP Roundtable is a podcast of web developers discussing PHP, JavaScript, community, open source, and anything else PHP nerds care about. It is broadcast live from Google Hangouts On-Air. For complete show notes or to watch the episodes in video format visit PHPRoundtable.com. And join the conversation live! Just subscribe to the newsletter and never miss a live show.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-php-roundtable/id972248395?mt=2"
		}, {
			"Podcast Title" : "Three Devs and a Maybe",
			"Website URL" : "http://threedevsandamaybe.com/",
			"Description" : "Join us each week as we discuss all things web development. Frequently joined by a far more intelligent guest on the show's topic, we by no means know everything, but love what we do. Topics range from daily developer life, PHP, frameworks, testing, good software design and our experiences using many other programming languages.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/three-devs-and-a-maybe/id729464185?mt=2"
		}, {
			"Podcast Title" : "Lately in PHP",
			"Website URL" : "http://www.phpclasses.org/blog/category/podcast/",
			"Description" : "News and interviews about the latest happenings in the PHP and Web development world. Hosted by Manuel Lemos of the PHPClasses.org site and Ernani Joppert. It is recorded in MP3 format at least once a month in the beginning of each month.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/lately-in-php-podcast/id373016482?mt=2"
		}, {
			"Podcast Title" : "That Podcast with Beau and Dave",
			"Website URL" : "https://thatpodcast.io/",
			"Description" : "Beau and Dave talking about life as dads, programmers, and entrepreneurs.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/that-podcast/id881491539"
		}, {
			"Podcast Title" : "Free the Geek.fm with Matthew Setter.",
			"Website URL" : "http://www.freethegeek.fm/",
			"Description" : "A fortnightly, fireside chat, on the ins and outs of building a rewarding career as a professional software developer. Looking at what it's like to do it, warts and all, as well as how to get started, what to expect, the good, the bad, and the ugly. Particular focus on PHP developers.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/free-the-geek-fm-with-matthew-setter/id1018923368?mt=2"
		}
	],
	"C++" : [{
			"Podcast Title" : "CppCast",
			"Website URL" : "http://cppcast.com/",
			"Description" : "The first podcast by C++ developers for C++ developers! Hosted by Rob Irving and Jason Turner.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/cppcast/id968703120?mt=2"
		}
	],
	"Java and JVM Languages" : [{
			"Podcast Title" : "JavaPubHouse Off-Heap's podcast",
			"Website URL" : "http://www.javaoffheap.com/",
			"Description" : "The Java Pub House Off-Heap Podcast brings together the latest tech news for the java professions. We go over the news and current issues and discuss them in depth, bringing the knowledge of a top circle of professionals from Chicago. Come take a listen and figure out what's going on in the Java world!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/javapubhouse-off-heaps-podcast/id985064111?mt=2"
		}, {
			"Podcast Title" : "Java Pub House",
			"Website URL" : "http://javapubhouse.libsyn.com/",
			"Description" : "This podcast talks about how to program in Java; not your tipical system.out.println(\"Hello world\"), but more like real issues, such as O/R setups, threading, getting certain components on the screen or troubleshooting tips and tricks in general. The format is as a podcast so that you can subscribe to it, and then take it with you and listen to it on your way to work (or on your way home), and learn a little bit more (or reinforce what you knew) from it.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/java-pub-house/id467641329?mt=2"
		}, {
			"Podcast Title" : "Illegal Argument",
			"Website URL" : "http://www.illegalargument.com/",
			"Description" : "Greg, Mark and Richard get together weekly and talk about things of interest in the Java community. Greg works for SimWorks (http://www.simworks.com) who specialize in mobile phone software. Mark works for SecureMX (www.smx.co.nz). Richard works for Blue Train Software (http://www.bluetrainsoftware.com)",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/illegal-argument/id318116151?mt=2"
		}, {
			"Podcast Title" : "vJUG",
			"Website URL" : "http://www.meetup.com/virtualjug/",
			"Description" : "vJUG audio recordings from Virtual Java Users Group",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/vjug/id977963286?mt=2"
		}, {
			"Podcast Title" : "Enterprise Java Newscast",
			"Website URL" : "http://www.jsfcentral.com/jsf-central/resources/enterprisejavanewscasts/",
			"Description" : "The Enterprise Java Newscast, hosted by Kito D. Mann, Ian Hlavats, and Daniel Hinojosa, is a monthly podcast that covers the latest headlines in the world of Enterprise Java development.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/enterprise-java-newscast/id464258008?mt=2"
		}
	],
	"Ruby" : [{
			"Podcast Title" : "Ruby on Rails Podcast ",
			"Website URL" : "http://5by5.tv/rubyonrails",
			"Description" : "The Ruby on Rails Podcast, a weekly conversation about Ruby on Rails,open source software, and the programming profession. Hosted by Kyle Daigle.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/ruby-on-rails-podcast/id840890158?mt=2"
		}, {
			"Podcast Title" : "Ruby Rogues",
			"Website URL" : "https://devchat.tv/ruby-rogues/",
			"Description" : "The Ruby Rogues podcast is a panel discussion about topics relating to programming, careers, community, and Ruby. We release a conversation with notable programmers and Rubyists each week to help programmers advance in their careers and skills.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-ruby-rogues/id705335155?mt=2",
			"Episodes John Was On" : "Episode 187 talking about marketing yourself as a software developer\nhttp://devchat.tv/ruby-rogues/187-marketing-yourself-as-a-software-developer-with-john-sonmez"
		}, {
			"Podcast Title" : "RubyPlus Podcast",
			"Website URL" : "https://rubyplus.com/podcasts",
			"Description" : "Podcast by RubyPlus.com",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/rubyplus-podcast/id1097360722?mt=2"
		}, {
			"Podcast Title" : "Start Here: Ruby on Rails",
			"Website URL" : "http://starthere.fm/",
			"Description" : "Are you a new Ruby on Rails developer in need of guidance? Well, StartHere: Ruby on Rails is the show for you! Dain Miller is your Ruby on Rails coach and he'll provide insight, and resources to help get you from knowing nothing to becoming a full-time Ruby ninja. Everyone starts somewhere and you’re starting here!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/start-here-ruby-on-rails/id987277709?mt=2"
		}
	],
	"Miscellaneous Languages" : [{
			"Podcast Title" : "The Cognicast",
			"Website URL" : "http://blog.cognitect.com/cognicast",
			"Description" : "A podcast by Cognitect, Inc. about software and the people that create it. We frequently talk about Clojure, ClojureScript, Datomic, agile software development, distributed systems, functional programming, and lots of other wonderfully geeky things.",
			"Subscribe URL" : "https://itunes.apple.com/is/podcast/the-cognicast-cognitect-blog/id498067022?mt=2"
		}, {
			"Podcast Title" : "Functional Geekery",
			"Website URL" : "http://www.functionalgeekery.com/",
			"Description" : "A podcast on Functional Programming, covering topics across multiple languages.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/functional-geekery/id790455326?mt=2"
		}, {
			"Podcast Title" : "LambdaCast",
			"Website URL" : "http://soundcloud.com/lambda-cast",
			"Description" : "LambdaCast is a podcast about functional programming for working developers. Our focus is to describe concepts using clear everyday language without watering anything down. If you've ever been curious about FP but were turned off by the jargon or unfamiliar concepts, this is the place to be.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/lambdacast/id1133087254?mt=2"
		}, {
			"Podcast Title" : "defn",
			"Website URL" : "https://soundcloud.com/defn-771544745",
			"Description" : "Podcast sharing enthusiasm about Clojure, its ecosystem and community. Vijay Kiran and Ray McDermott",
			"Subscribe URL" : "https://itunes.apple.com/is/podcast/defn/id1114899563?mt=2"
		}, {
			"Podcast Title" : "Programming Throwdown ",
			"Website URL" : "http://www.programmingthrowdown.com/",
			"Description" : "Programming Throwdown attempt to educate Computer Scientists and Software Engineers on a cavalcade of programming and tech topics. Every show will cover a new programming language, so listeners will be able to speak intelligently about any programming language.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/programming-throwdown/id427166321?mt=2"
		}, {
			"Podcast Title" : "Test Talks",
			"Website URL" : "https://joecolantonio.com/testtalks/",
			"Description" : "TestTalks is a weekly podcast hosted by Joe Colantonio, which geeks out on all things software test automation. TestTalks covers news found in the testing space, reviews books about automation and speaks with some of the thought leaders in the test automation field. We’ll aim to interview some of today’s most successful and inspiring software engineers and test automation thought leaders.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/testtalks-automation-awesomeness/id826722706?mt=2",
			"Episodes John Was On" : "Episode 36, talking about my Soft Skills: The Software Developer’s Life Manual book.\nhttp://joecolantonio.com/testtalks/36-john-sonmez-the-software-developers-life-manual\nEpisode 3, talking about building an automated testing framework with Selenium and personal branding.\nhttp://joecolantonio.com/testtalks/03-selenium-automation-framework/"
		}, {
			"Podcast Title" : "Laravel News",
			"Website URL" : "https://laravel-news.com/podcast",
			"Description" : "The Laravel News Podcast brings you all the latest news and events related to Laravel. This podcast is hosted by Eric L. Barnes and Jack Fruh.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/laravel-news-podcast/id1051289963?mt=2"
		}, {
			"Podcast Title" : "The Laracasts Snippet",
			"Website URL" : "https://laracasts.simplecast.fm/",
			"Description" : "The Laracasts snippet, each episode, offers a single thought on some aspect of web development. Nothing more, nothing less. Hosted by Jeffrey Way.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-laracasts-snippet/id1059530816?mt=2"
		}, {
			"Podcast Title" : "The Laravel Podcast",
			"Website URL" : "https://laravel.com/",
			"Description" : "The Laravel Podcast brings you Laravel and PHP development news and discussion. The podcast is hosted by Matt Stauffer and regular guests include Taylor Otwell (the creator of Laravel) and Jeffrey Way (the creator of Laracasts).",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-laravel-podcast/id653204183?mt=2"
		}, {
			"Podcast Title" : "Elixir Fountain",
			"Website URL" : "http://feed.elixirfountain.com/",
			"Description" : "Your weekly podcast for news & interviews from around the @Elixirlang Community hosted by @johnny_rugger RSS Feed: http://feed.elixirfountain.com",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/elixir-fountain/id1039942918?mt=2"
		}, {
			"Podcast Title" : "Mastering Embedded Systems",
			"Website URL" : "http://embeddedsuccess.com/podcast/",
			"Description" : "I have identified four major problems in mastering Embedded Systems: 1. Not enough specialists; 2. inadequate design and poor detections of faults; 3. mandatory multi-site approaches are failing; 4. bad mistakes in managing Virtual Teams I'll teach you the know-how and the tools to overcome these challenges. Out of practice into practice. Join my stories, see my own mistakes or successes. Make the best out of my tips and advices. And lift your own results to the next level.",
			"Subscribe URL" : "https://itunes.apple.com/de/podcast/mastering-embedded-systems/id1015304945?l=en"
		}, {
			"Podcast Title" : "Go Time",
			"Website URL" : "https://changelog.com/gotime",
			"Description" : "A weekly panelist podcast discussing the Go programming language, the community, and everything in between.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/go-time/id1120964487"
		}, {
			"Podcast Title" : "The Haskell Cast",
			"Website URL" : "http://www.haskellcast.com/",
			"Description" : "Listen to regular interviews with the Haskell community. The podcast covers news, libraries, and whatever other topics we wander onto with our guests.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-haskell-cast/id694047404?mt=2"
		}, {
			"Podcast Title" : "Elm Town",
			"Website URL" : "https://elmtown.github.io/",
			"Description" : "A podcast about the people making and using the Elm language, and the things that they do.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/elm-town/id1158047037?mt=2"
		}, {
			"Podcast Title" : "Talking Kotlin",
			"Website URL" : "http://talkingkotlin.com/",
			"Description" : "A bimonthly podcast that covers the Kotlin programming language by JetBrains, as well as related technologies. Hosted by Hadi Hariri",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/talking-kotlin/id1194631266?mt=2"
		}
	],
	"Data and Machine Learning" : [{
			"Podcast Title" : "Partially Derivative",
			"Website URL" : "http://partiallyderivative.com/",
			"Description" : "The everyday data of the world around us, hosted by data science super geeks. For the nerdy and nerd curious.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/partially-derivative/id942048597?mt=2"
		}, {
			"Podcast Title" : "Data Skeptic",
			"Website URL" : "http://dataskeptic.com/",
			"Description" : "The Data Skeptic Podcast features interviews and discussion of topics related to data science, statistics, machine learning, artificial intelligence and the like, all from the perspective of applying critical thinking and the scientific method to evaluate the veracity of claims and efficacy of approaches.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/data-skeptic/id890348705?mt=2"
		}, {
			"Podcast Title" : "Linear Digressions",
			"Website URL" : "http://lineardigressions.com/",
			"Description" : "In each episode, your hosts explore machine learning and data science through interesting (and often very unusual) applications.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/linear-digressions/id941219323?mt=2"
		}, {
			"Podcast Title" : "O'Reilly Data Show",
			"Website URL" : "https://www.oreilly.com/topics/data",
			"Description" : "The O'Reilly Data Show explores the opportunities and techniques driving big data, data science, and AI. Through interviews and analysis, we highlight the people putting data to work.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/oreilly-data-show-oreilly/id944929220?mt=2"
		}, {
			"Podcast Title" : "Learning Machines 101",
			"Website URL" : "http://www.learningmachines101.com/",
			"Description" : "Smart machines based upon the principles of artificial intelligence and machine learning are now prevalent in our everyday life. For example, artificially intelligent systems recognize our voices, sort our pictures, make purchasing suggestions, and can automatically fly planes and drive cars. In this podcast series, we examine such questions such as: How do these devices work? Where do they come from? And how can we make them even smarter and more human-like? These are the questions that will be addressed in this podcast series!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/learning-machines-101/id892779679?mt=2"
		}, {
			"Podcast Title" : "Data Stories",
			"Website URL" : "http://datastori.es/",
			"Description" : "Enrico Bertini and Moritz Stefaner discuss the latest developments in data analytics, visualization and related topics.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/data-stories/id502854960?mt=2"
		}, {
			"Podcast Title" : "Talking Machines",
			"Website URL" : "http://www.thetalkingmachines.com/blog/",
			"Description" : "Talking Machines is your window into the world of machine learning. Your hosts, Katherine Gorman and Ryan Adams, bring you clear conversations with experts in the field, insightful discussions of industry news, and useful answers to your questions. Machine learning is changing the questions we can ask of the world around us, here we explore how to ask the best questions and what to do with the answers.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/talking-machines/id955198749?mt=2"
		}, {
			"Podcast Title" : "This Week in Machine Learning & AI",
			"Website URL" : "https://twimlai.com/",
			"Description" : "This Week in Machine Learning & AI brings you the week’s most interesting and important stories from the worlds of machine learning and artificial intelligence. We discuss the latest developments in research, technology, and business, and explore interesting projects from across the web. Technologies covered include: machine learning, artificial intelligence, deep learning, natural language processing, neural networks, analytics, big data and more.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/this-week-in-machine-learning-ai-podcast/id1116303051?mt=2"
		}
	],
	"Agile and Scrum" : [{
			"Podcast Title" : "Agile for Humans",
			"Website URL" : "http://ryanripley.com/agile-for-humans/",
			"Description" : "A weekly podcast dedicated to the individuals and interactions that make agile work. My goal is to help you create safe and collaborative working environments where people are empowered to do their best work.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/agile-for-humans-podcast-devoted/id991671232?mt=2"
		}, {
			"Podcast Title" : "The Agile Coffee Podcast",
			"Website URL" : "http://agilecoffee.com/",
			"Description" : "AgileCoffee brings together an engaged group of practitioners passionate about Agile methodologies and Lean practices. Our format mimics the Lean Coffee model of structured, agenda-free meetings where agilists (or curious bystanders) come together to exchange ideas. Expand your understanding of Agile / Lean methods. Bring your own topic related to the Lean family (XP, Scrum, Kanban & Agile) and apply discussions to software development, testing, project management, product ownership, coaching or just life-hacking.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-agile-coffee-podcast/id880524138?mt=2"
		}, {
			"Podcast Title" : "This Agile Life",
			"Website URL" : "http://www.thisagilelife.com/",
			"Description" : "Agile software development is a mix of best practices and philosophical tenants. But there is a big difference between the ideal situations and what developers face in the real world. This Agile Life talks with some of the best in the business about the challenges of software engineering and how real world solutions can bring the promise of Agile methodologies to your software projects.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/this-agile-life/id549367028?mt=2"
		}, {
			"Podcast Title" : "The Agile Revolution",
			"Website URL" : "https://theagilerevolution.com/",
			"Description" : "Join Craig Smith, Tony Ponton and Renee Troughton on a journey through the world of Agile as they look at recent blogs related to Agile, investigate practices and techniques, look at tools and answer your questions as well as talk to creative minds in the Agile community. The revolutionists focus on not just Agile as it relates to software development but also how it applies to business, transition, culture, people and a whole lot more!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-agile-revolution/id451966819?mt=2"
		}, {
			"Podcast Title" : "Scrum Master Toolbox Podcast",
			"Website URL" : "http://www.scrum-master-toolbox.com/",
			"Description" : "Scrum Master Toolbox Podcast: The Agile and Lean podcast that gives you tips and tricks to improve your craft as a Scrum Master. Listen to daily doses of inspiring conversations with Scrum Masters from the all over the world. Join Vasco Duarte as he interviews guests to get you the latest and best tips on how to be an effective, and impactful Scrum Master.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/scrum-master-toolbox-podcast/id963592988?mt=2"
		}, {
			"Podcast Title" : "Agile in 3 Minutes",
			"Website URL" : "https://agilein3minut.es/archive/",
			"Description" : "The simplest podcast that could possibly work.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/agile-in-3-minutes/id1043107219?mt=2"
		}, {
			"Podcast Title" : "Agile Answers",
			"Website URL" : "https://weisbart.com/",
			"Description" : "Every week, Certified Scrum Trainer and Agile Coach Adam Weisbart delivers actionable advice about the Scrum framework, agile software development, and agile management. Not content with doling out hypothetical advice from an ivory tower, Adam takes calls from real people struggling with real-world problems. Using his years of experience as an Agilist and practitioner of Scrum, he provides concise, step-by-step instructions that give you new tools to conquer your challenges. Tune in! Adam will be discussing Sprint Planning, Daily Scrum, Sprint Review, Sprint Retrospective, Backlog Refinement, Scaling Scrum, Lean Startup, Test Driven Development (TDD), Behavior Driven Development (BDD), Paper Prototyping, QA in Scrum, the role of agile managers, servant leadership, agile coaching, and more!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/agile-answers/id1037924282?mt=2"
		}
	],
	"DevOps" : [{
			"Podcast Title" : "DevOps Cafe",
			"Website URL" : "http://devopscafe.org/",
			"Description" : "In this interview driven show, John Willis and Damon Edwards take a pragmatic look at the technology, tools, and business developments behind the emerging DevOps movement.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/devops-cafe-podcast/id371931111?mt=2"
		}, {
			"Podcast Title" : "The Food Fight Show",
			"Website URL" : "http://foodfightshow.org/",
			"Description" : "The Podcast where DevOps chefs do battle",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-food-fight-show/id495577922?mt=2"
		}, {
			"Podcast Title" : "PowerScripting Podcast",
			"Website URL" : "https://powershell.org/podcast/",
			"Description" : "The PowerScripting Podcast is for people learning Windows PowerShell. In each episode we bring you news, interviews and resources about Windows PowerShell to help in your learning. We also bring you tips, tricks, one-liner's and gotchas that I discover, as well as those submitted by listeners. We talk about scripting in PowerShell (and occasionally in VBScript) and ways to make your job \"a little easier.\" We have heard PowerShell described as \"the future of Windows administration\" so the time to start learning it is now! Your feedback is always welcome. Thanks for subscribing!",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/powerscripting-podcast/id256074147?mt=2"
		}, {
			"Podcast Title" : "RunAs Radio",
			"Website URL" : "http://www.runasradio.com/",
			"Description" : "RunAs Radio is a weekly Internet Audio Talk Show for IT Professionals working with Microsoft products.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/runas-radio/id253682066?mt=2"
		}, {
			"Podcast Title" : "Arrested DevOps",
			"Website URL" : "https://www.arresteddevops.com/",
			"Description" : "Arrested DevOps is hosted by Matt Stratton, Trevor Hess, and Bridget Kromhout. ADO is the podcast that helps you achieve understanding, develop good practices, and operate your team and organization for maximum DevOps awesomeness.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/arrested-devops/id773888088?mt=2"
		}, {
			"Podcast Title" : "Puppet Podcast",
			"Website URL" : "https://puppet.com/podcasts",
			"Description" : "The Puppet Podcast features Puppet community members talking about the latest trends in configuration management & cloud automation as well as DevOps culture.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/puppet-podcast/id546792095?mt=2"
		}
	],
	"Cloud" : [{
			"Podcast Title" : "The Cloudcast (.net)",
			"Website URL" : "http://www.thecloudcast.net/",
			"Description" : "Aaron Delp and Brian Gracely host this award-winning weekly podcast to discuss the technology and organizational changes that are driving the convergence of today's Data Centers and Cloud Computing. Topics include Cloud Computing | AWS | Azure | GCP | Serverless | DevOps | AppDev | SaaS | IoT. Guests are industry thought-leaders and leaders of companies changing the IT industry.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/cloudcast-.net-weekly-cloud/id417826820?mt=2"
		}, {
			"Podcast Title" : "Cloud Computing Weekly Podcast",
			"Website URL" : "http://www.cloudtp.com/",
			"Description" : "Hosted by Cloud Computing expert David Linthicum, this podcast is a no-hype look at the world of Cloud Computing. This podcast talks about what's new, what's working, and has expert guests who will provide you with the advice you need to be successful in the clouds.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/cloud-computing-weekly-podcast/id641566140?mt=2"
		}, {
			"Podcast Title" : "Microsoft Cloud Show",
			"Website URL" : "http://www.microsoftcloudshow.com/podcast",
			"Description" : "Andrew Connell and Chris Johnson come together to share their insights and experience from the perspective of developers on the latest news, notes, commentary and listener questions on Microsoft cloud technologies including Microsoft Azure, Office 365 and SharePoint.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/microsoft-cloud-show/id731565415?mt=2"
		}, {
			"Podcast Title" : "Office 365 Developer Podcast",
			"Website URL" : "http://blogs.office.com/",
			"Description" : "The only show focused on Office 365 development where we talk to the experts from all over the globe coding on the Office 365 platform. For more information on Office 365 development, please visit dev.office.com and follow us on the @OfficeDev.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/office-365-developer-podcast/id886295635?mt=2"
		}, {
			"Podcast Title" : "Microsoft Azure Cloud Cover Show ",
			"Website URL" : "https://channel9.msdn.com/Shows/Cloud+Cover",
			"Description" : "Microsoft Azure Cloud Cover is your eye on the Microsoft Cloud. Join Chris Risner and Haishi Bai as they cover Microsoft Azure, demonstrate features, discuss the latest news + announcements, and share tips and tricks.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/microsoft-azure-cloud-cover/id417256457?mt=2"
		}, {
			"Podcast Title" : "Azure Tuesdays with Corey",
			"Website URL" : "https://channel9.msdn.com/Shows/Tuesdays-With-Corey",
			"Description" : "Corey Sanders answers your questions about Microsoft Azure - Virtual Machines, Web Sites, Mobile Services, Dev/Test etc. If you have a question, Corey will find the answer! Corey Sanders is a Director of Group Program Management on the Microsoft Azure Compute team.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/azure-tuesdays-with-corey/id1023243001?mt=2"
		}, {
			"Podcast Title" : "The Azure Podcast",
			"Website URL" : "http://azpodcast.azurewebsites.net/",
			"Description" : "Cale Teeter, Evan Basilik & Sujit D'Mello work at Microsoft as consultants in the cloud and services area. They specialize in building enterprise apps and services that leverage the cloud.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/the-azure-podcast/id728193635?mt=2"
		}, {
			"Podcast Title" : "Azure Friday",
			"Website URL" : "http://s.ch9.ms/Shows/Azure-Friday",
			"Description" : "Scott Hanselman sits down with the actual engineers who build Azure on his journey to learn how to program the cloud. No marketing, no BS, just two engineers and a laptop in short managable chunks. Join the conversation at http://Friday.Azure.com",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/azure-friday-hd-channel-9/id739501868?mt=2"
		}, {
			"Podcast Title" : "Code Coverage",
			"Website URL" : "http://www.codecoverage.org/",
			"Description" : "A fortnightly podcast with developers working with all things Salesforce and Salesforce1. Especially force.com (Apex, Visualforce) but also Heroku and ExactTarget.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/code-coverage-salesforce-developer/id880831007?mt=2"
		}, {
			"Podcast Title" : "The Salesforce Admin Podcast",
			"Website URL" : "https://admin.salesforce.com/",
			"Description" : "The Salesforce Admins podcast shines the light on real Salesforce Admins solving problems with clicks and not code. This 20 minute weekly podcast hosted by Mike Gerholdt and Gillian Bruce feature a talk show format along with talented Salesforce Admins who are solving real problems in the cloud by implementing Enterprise CRM solutions and having fun doing it.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/buttonclick-admin-podcast/id914088438?mt=2"
		}, {
			"Podcast Title" : "Good Day, Sir! Show",
			"Website URL" : "http://www.gooddaysirpodcast.com/",
			"Description" : "The Good Day, Sir! Show is a weekly technology and software development podcast, with a strong focus on the Salesforce platform. Keeping developers and non-developers informed with our own unique brand of casual, honest, and entertaining commentary.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/good-day-sir!-show-salesforce/id732617888?mt=2"
		}, {
			"Podcast Title" : "CloudFocus Weekly",
			"Website URL" : "http://www.cloudfocusweekly.com/",
			"Description" : "A weekly show covering the latest cloud computing news, Salesforce.com happenings and events. If it is happening in the cloud we are focused on it. Don't miss the CloudFocus App Pick of the Week at the end over every show.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/cloudfocus-weekly/id382867624?mt=2"
		}, {
			"Podcast Title" : "Speaking in Tech",
			"Website URL" : "http://speakingintech.com/",
			"Description" : "Speaking in Tech: \"Where Enterprise Tech meets Consumer Tech...\". Speaking in Tech is hosted by Greg Knieriemen, Ed Saipetch and Sarah Vela. Topics include popular tech, data storage, cloud computing, networking, storage virtualization, server virtualization, backup, disaster recovery and anything else interesting in the tech world. Disclosure: Speaking in tech does not receive support directly or indirectly from vendors or guests. Vendor relationships are disclosed on the podcast.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/speaking-in-tech/id469061956?mt=2"
		}, {
			"Podcast Title" : "Todd Klindt's SharePoint and Cloud Podcast",
			"Website URL" : "http://www.toddklindt.com/blog/default.aspx",
			"Description" : "In this podcast Todd Klind and Shane Young cover topics they've seen over the last week as a SharePoint administrators and general cloudy nerds. They also throw in other Microsoft related tech topics like Office 365, PowerShell, SQL Server, Azure, and the occasional Windows 10 topic. To mix things up they'll have a gadget reviews now and then and maybe even a funny cat video or two.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/todd-klindts-sharepoint-and-cloud-podcast/id318847966?mt=2"
		}
	],
	"SQL and Databases" : [{
			"Podcast Title" : "SQL Data Partners",
			"Website URL" : "http://sqldatapartners.com/podcast",
			"Description" : "In this podcast, I discuss a variety of SQL Server related topics mixed with a sprinkling of professional development and I talk with some of the biggest names in the industry.  I want to introduce new and familiar topics and talk about them in a way you may have not considered.  We are all on different stages as data professionals, and we can all something new.  I hope you will join me on the SQL trail compañeros–you won’t regret it.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/sql-data-partners-podcast/id1027394388?mt=2"
		}, {
			"Podcast Title" : "SQL Server Radio",
			"Website URL" : "http://www.sqlserverradio.com/",
			"Description" : "SQL Server Radio is a Podcast for SQL Server DBAs, database developers, architects, system administrators, and anyone else who is interested in the Microsoft SQL Server platform and the Microsoft data platform in general. As the data world changes, we also occasionally talk about other data platforms and services like Azure and Amazon cloud services, Elastic Search, Hadoop, MongoDB, Machine Learning, and much more.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/sql-server-radio/id907987517?mt=2"
		}, {
			"Podcast Title" : "Voice of the DBA's Podcast",
			"Website URL" : "http://www.voiceofthedba.com/",
			"Description" : "Steve is a matter-of-fact DBA that has a lot of experience in the trenches of database development and database maintenance. He is a straight-shooter that doesn't pull any punches. He offers his opinions and makes you question what you would do in the same situations. A must listen for anyone responsible for data in an organization.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/voiceofthedbas-podcast/id268045050?mt=2"
		}, {
			"Podcast Title" : "SQL Down Under",
			"Website URL" : "http://www.sqldownunder.com/",
			"Description" : "Interviews with influential SQL Server identities from around the world",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/sql-down-under/id503822116?mt=2"
		}, {
			"Podcast Title" : "SQL Server Pain Relief",
			"Website URL" : "https://www.brentozar.com/",
			"Description" : "SQL Server Pain Relief: Office Hours is like listening in while patients bring their SQL Server pains to the emergency room, and the doctors give their opinions. Join your host, performance tuning specialist Brent Ozar, and his highly-qualified SQL Server Medical Team as they give you an inside look into some of the best solutions to your server problems. Tune in to get the best tips for performance tuning, virtualization, disaster recovery and much more. When you’re ready to do your own surgery, grab our free First Responder Kit at www.BrentOzar.com.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/sql-server-pain-relief-office/id1070611929?mt=2"
		}, {
			"Podcast Title" : "Dear SQL DBA",
			"Website URL" : "https://www.littlekendra.com/submit-a-dear-dba-question/",
			"Description" : "Kendra Little answers burning questions from SQL Server Database Administrators -- from dealing with SAN Administrators to handling index rebuilds, she helps DBAs improve their jobs.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/dear-sql-dba/id1117507864?mt=2"
		}, {
			"Podcast Title" : "GroupBy – Free SQL Server Training",
			"Website URL" : "https://groupby.org/",
			"Description" : "GroupBy.org is free technical training by the community, for the community. Volunteer speakers submit abstracts at GroupBy.org and you – the attendee – vote to pick the sessions. Want to present your own session, or just vote on others? Join us at GroupBy.org.",
			"Subscribe URL" : "https://itunes.apple.com/us/podcast/groupby-free-sql-server-training/id1196061826?mt=2"
		}
	]
}