{"title":[" E-cast: Analysis and Development of Safety-Critical Embedded Systems and Software for Automotive Applications"],"itunes:author":["OpenSystems Media, with Xavier Fornari (SCADE Suite Product Manager and Leader of Automotive Action at, ANSYS System Business Unit); Moderator: Rich Nass, OpenSystems Media..."],"itunes:subtitle":[""],"itunes:summary":[" More than 60 percent of a new vehicle's cost comes from its advanced electronics and software systems.  Since many of the human-machine interface (HMI) functions guided by these electronic systems are mission-critical, it's essential that all automotive systems work together with complete reliability."],"description":[{"_":"<p>More than 60 percent of a new vehicle's cost comes from its advanced electronics and software systems. Since many of the human-machine interface (HMI) functions guided by these electronic systems are mission-critical, it's essential that all automotive systems work together with complete reliability. That means tens of millions of lines of software code that control advanced driver assistance systems (ADAS) must be flawless.<p><i>Presented by: Ansys</i></p>&lt;p&gt;&lt;i&gt;Speaker(s): Xavier Fornari (SCADE Suite Product Manager and Leader of Automotive Action at, ANSYS System Business Unit)&lt;/p&gt;<img src=\"http://feeds.feedburner.com/~r/embedded/~4/JTltd87rdzw\" height=\"1\" width=\"1\" alt=\"\"/>","$":{"type":"html"}}],"itunes:duration":["01:00:00"],"guid":[{"_":"http://ecast.opensystemsmedia.com/748","$":{"isPermaLink":"false"}}],"link":["http://m.opensystemsmedia.com/~r/embedded/~3/JTltd87rdzw/748"],"pubDate":["Wed, 26 Jul 17 17:00:00 +0200"],"itunes:keywords":["Xavier Fornari (SCADE Suite Product Manager and Leader of Automotive Action at, ANSYS System Business Unit), Techcast, Tech cast, e ecast, Embedded, Embedded Systems, Embedded Computing, OpenSystems Publishing, OpenSystems Media, Open Systems Media, Open Systems, opensystems, E-cast, ecast"],"author":["kwitte@gmail.com (OpenSystems Media)"],"media:content":[{"$":{"url":"http://m.opensystemsmedia.com/~r/embedded/~5/7kLFgGovj_8/2017-07-26.mp3","fileSize":"14042381","type":"audio/x-mp3"}}],"itunes:explicit":["no"],"feedburner:origLink":["http://ecast.opensystemsmedia.com/748"],"enclosure":[{"$":{"url":"http://m.opensystemsmedia.com/~r/embedded/~5/7kLFgGovj_8/2017-07-26.mp3","length":"14042381","type":"audio/x-mp3"}}],"feedburner:origEnclosureLink":["http://ecast.cloud.opensystemsmedia.com/podcasts/2017-07-26.mp3"]}