{"title":["How big data and AI will reshape the automotive industry"],"pubDate":["Thu, 20 Jul 2017 15:10:00 +0000"],"description":["<p><em>The O’Reilly Data Show Podcast: Evangelos Simoudis on next-generation mobility services.</em></p><p>In this episode of the <a href=\"https://www.oreilly.com/ideas/topics/oreilly-data-show-podcast\">Data Show</a>, I spoke with <a href=\"https://www.linkedin.com/in/evangelossimoudis/\">Evangelos Simoudis</a>, co-founder of <a href=\"http://synapsepartners.co/\">Synapse Partners</a> and <a href=\"https://www.oreilly.com/people/62273-evangelos-simoudis\">a frequent contributor</a> to O’Reilly. He recently published a book entitled <em><a href=\"https://www.amazon.com/Big-Data-Opportunity-Driverless-Future/dp/0998067717\">The Big Data Opportunity in Our Driverless Future</a></em>, and I wanted get his thoughts on the transportation industry and the role of big data and analytics in its future. Simoudis is an entrepreneur, and he also advises and invests in many technology startups. He became interested in the automotive industry long before the current wave of autonomous vehicle startups was in the planning stages.</p><p>Here are some highlights from our conversation:</p>\r\n<h2>Understanding the automotive industry</h2>\r\n<blockquote><p>The more I started spending time with the automotive industry, the more I came to realize that, because of the autonomous vehicle technology and because of various forms of mobility services, which are stemming from new business models, the incumbent automotive industry is in significant risk of being disrupted.</p>\r\n\r\n<p>If you were to look at the automotive industry, the first thing that is very striking is that there's a small number of very large companies that control a number of different labels. With GM, we talk about Chevy, we talk about Buick, we talk about Opel in Europe. There are a very small number of companies that control this trillion dollar industry.</p>\r\n\r\n<p>The other thing that is interesting is that these companies are responsible for designing the vehicle, manufacturing it, assembling it, post-manufacturing, and then creating demand, whereas the sale of the vehicle is done through the dealers. And they're paying relatively little attention to what happens post-sale. So, that means there is a relatively little understanding of consumer behavior.</p>\r\n\r\n<p>The third observation is that the reason there are so few of these companies is because starting one is very capital intensive. And if you look at how much money, for example, a company like Tesla has been able to raise, you get a sense of what kind of capital is necessary. And the next point is that even though there is a lot of capital that's being raised, in the end this is a relatively low margin business. Where you try to make it up is in volume. That's why, if you look at all these corporations, they have extremely sophisticated supply chains, extremely sophisticated manufacturing lines, highly optimized, because they are working on maintaining these margins.</p></blockquote>\r\n\r\n<h2>Infrastructure for autonomous vehicles</h2>\r\n<blockquote><p>A vehicle needs to know very much what's happening around it. So that means it needs to receive signals from roads, bridges, other vehicles. ... The term people use is <a href=\"https://en.wikipedia.org/wiki/Vehicle-to-everything\">V2X or vehicle-to-everything</a> communication.</p>\r\n\r\n<p>It will take a very long time to have the preponderance of vehicles being autonomous. So, we need infrastructure that will enable cars to safely operate in a hybrid world between autonomous vehicles and manually operated vehicles. I think the experiments that today involve just a few tens of cars will expand over the next few years. And I think the result of those experiments will give us an understanding and appreciation of the investments that we need to make and how to prioritize them, as well as the regulations that we will need to institute in order to have this type of hybrid environment operate safely.</p></blockquote>\r\n\r\n<h2>AI and big data</h2>\r\n<blockquote><p>The argument that I'm making, and this actually comes from my education on AI and my work on AI since the mid ‘80s, is that while machine learning is important, I think everybody needs to appreciate that it's not only about machine learning. In order to bring to realization an autonomous vehicle, you need more than machine learning. And, of course, within machine learning we have neural network learning and particularly deep learning, and these are very important areas.</p>\r\n\r\n<p>But people need to realize that an autonomous vehicle requires the ability to plan, requires the ability to reason, to represent knowledge, to search. All of these are components of AI. What I'm hoping to impart is that it's not only about machine learning and particularly not about deep learning. The popular press, I think, is leading everybody to believe that it's only about deep learning.</p>\r\n\r\n<p>There is the autonomous driving technology and then the data cloud, where big data gets processed, stored, and analyzed. I think we will have multiple cloud providers. In fact, I'm betting on that through my investments in the space. I think that those cloud providers will be in the application layer. So, those cloud providers may be utilizing infrastructures from the likes of Microsoft or Amazon or other generic clouds.</p></blockquote>\r\n\r\n\r\n\r\n<p><strong>Related resources:</strong></p>\r\n<ul>\r\n  <li>\r\n    <p><em><a href=\"https://www.oreilly.com/ideas/creating-autonomous-vehicle-systems\">Creating autonomous vehicle systems</a></em>: Shaoshan Liu on the technology behind self-driving cars</p>\r\n  </li>\r\n  <li>\r\n    <p><em><a href=\"https://www.safaribooksonline.com/library/view/strata-hadoop/9781491976166/video301053.html?utm_source=oreilly&amp;utm_medium=newsite&amp;utm_campaign=20170719_data_show_evangelos_simoudis_related_resources_strata_data_san_jose_presentation\">Big data opportunities in next-generation mobility</a></em>: Evangelos Simoudis’ presentation at Strata Data San Jose</p>\r\n  </li>\r\n  <li>\r\n    <p><em><a href=\"https://www.oreilly.com/ideas/turning-big-data-into-actionable-insights-2\">Turning big data into actionable insights</a></em>: Evangelos Simoudis on a previous episode of the Data Show</p>\r\n  </li>\r\n  <li>\r\n    <p><em><a href=\"https://www.oreilly.com/ideas/a-new-value-chain-for-next-generation-mobility\">A new value chain for next-generation mobility</a></em></p>\r\n  </li>\r\n  <li>\r\n    <p><em><a href=\"https://www.oreilly.com/ideas/exploring-the-process-of-insight-generation\">Exploring the process of insight generation</a></em></p>\r\n  </li>\r\n</ul>"],"itunes:summary":["<p>In this episode of the <a href=\"https://www.oreilly.com/ideas/topics/oreilly-data-show-podcast\">Data Show</a>, I spoke with <a href=\"https://www.linkedin.com/in/evangelossimoudis/\">Evangelos Simoudis</a>, co-founder of <a href=\"http://synapsepartners.co/\">Synapse Partners</a> and <a href=\"https://www.oreilly.com/people/62273-evangelos-simoudis\">a frequent contributor</a> to O’Reilly. He recently published a book entitled <em><a href=\"https://www.amazon.com/Big-Data-Opportunity-Driverless-Future/dp/0998067717\">The Big Data Opportunity in Our Driverless Future</a></em>, and I wanted get his thoughts on the transportation industry and the role of big data and analytics in its future. Simoudis is an entrepreneur, and he also advises and invests in many technology startups. He became interested in the automotive industry long before the current wave of autonomous vehicle startups was in the planning stages.</p>"],"itunes:author":["O'Reilly Media"],"link":["https://www.oreilly.com/ideas/how-big-data-and-ai-will-reshape-the-automotive-industry"],"itunes:explicit":["no"],"itunes:order":["1"],"itunes:duration":["00:51:05"],"enclosure":[{"$":{"url":"http://dts.podtrac.com/redirect.mp3/cdn.oreillystatic.com/radar/datashow-podcast/How_big_data_and_AI_will_reshape_the_automotive_industry.mp3","length":"51380224","type":"audio/mpeg"}}],"category":["data","big data","transportation","autonomous cars","next-generation mobility services","ai","artificial intelligence","automotive industry"]}