{"title":["Using Salesforce for Social Good with Melissa Prcic"],"link":["https://admin.salesforce.com/using-salesforce-social-good-melissa-prcic"],"pubDate":["Thu, 27 Jul 2017 12:00:23 +0000"],"guid":[{"_":"https://admin.salesforce.com/?p=118972","$":{"isPermaLink":"false"}}],"comments":["https://admin.salesforce.com/using-salesforce-social-good-melissa-prcic#respond"],"wfw:commentRss":["https://admin.salesforce.com/using-salesforce-social-good-melissa-prcic/feed"],"slash:comments":["0"],"category":["Podcast"],"description":["<p>Today on the Salesforce Admins Podcast we’re speaking with Melissa Prcic, a Developer at Stand for Children. Join us to hear about how she builds the technology behind Stand for Children’s anti-bullying efforts, as well as her work on the steering committee for Rad Women, and her unique path to […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://admin.salesforce.com/using-salesforce-social-good-melissa-prcic\">Using Salesforce for Social Good with Melissa Prcic</a> appeared first on <a rel=\"nofollow\" href=\"https://admin.salesforce.com\">Salesforce Admins</a>.</p>"],"content:encoded":["<p>Today on the Salesforce Admins Podcast we’re speaking with Melissa Prcic, a Developer at Stand for Children.</p>\n<p>Join us to hear about how she builds the technology behind Stand for Children’s anti-bullying efforts, as well as her work on the steering committee for Rad Women, and her unique path to becoming a Dev.</p>\n<p>You should <a href=\"https://itunes.apple.com/us/podcast/salesforce-admins-podcast/id914088438?mt=2\">subscribe</a> for the full episode, but here are a few takeaways from our conversation with Melissa Prcic.</p>\n<p><strong>Jumping Into Salesforce</strong></p>\n<p>Melissa’s undergrad degrees were in Political Science, International Relations, and Critical Gender Studies, so not exactly the path you picture when you think about someone who makes their living in tech. When she started working at her first nonprofit, however, she was astonished to find that they didn’t have a database. This led her to take a class and eventually build her first database in Access.</p>\n<p>Melissa quickly realized that she had a passion for data and tech, which lead her first to a database administrator position and later to Stand for Children, where they were starting to adopt Salesforce. “I dove into the deep end and learned as fast as I could because we did a really quick migration, and I fell in love with the platform.”</p>\n<p>They started by treating it like a regular business migration, targeting the core business processes that they needed to get working by January 1st. “I did a lot of jumping in and playing around—the idea of having a sandbox was totally new to me and exciting once I figured out what that meant.” With the help of both a back end and front end developer, they were able to get everything working, and Melissa quickly realized that being a Salesforce Dev was the perfect fit.</p>\n<p><strong>Rad Women and Stand for Children</strong></p>\n<p>Melissa works with two great organizations to use her tech skills for social good. She’s on the steering committee for Rad Women, an all-volunteer organization that hosts 10-week sessions for women who have at least 2 years of experience on the platform but want to learn how to code. “For me the special sauce there is that you’re with a small group,” which positions the volunteer coaches to act as mentors, Melissa says. Setting up that relationship is key to getting more women involved in tech, because there’s someone you can go to when you have questions.</p>\n<p>Professionally, she works with Stand for Children, an education advocacy nonprofit that works to improve the quality of public education. One of the ways they do that is through community organizing. They constantly have staff out in the field working with parents, teachers, and trying to get people involved both in their schools and politically in order to improve education. The problem was that even though these organizers needed a database, they weren’t exactly the ideal users for out-of-the-box Salesforce.</p>\n<p><strong>Using Salesforce as an Organizing Platform</strong></p>\n<p>Melissa’s team ended up building something called the Organizer App to solve their problem. They created an HTML5 custom front end that sits on top of Salesforce to make it more mobile-friendly. As Melissa put it, “It puts that data in the hands of the people who are actually doing the work.” Salesforce helped give Stand for Children a common definition of success: what the goals were and how well they were doing. They could look at metrics across several states and really get an idea of whether or not they were moving the needle the way they wanted to.</p>\n<p>Melissa’s team’s initial success has led the organization to look for new ways to use tech to help them do what they do better. Up until now their tech projects have been inward-facing, but their next project is about branching into communities. It’s called the Kind Schools Project, and it’s about getting research-based curriculum support to teachers who want to foster an environment of kindness. As Melissa says, “Teaching is about empathy, both having empathy towards each other in the classroom and throughout the school.”</p>\n<p>Their first major push for this project is to get at least half of all teachers at participating middle schools to sign up, which means that they need a place to go to register, log in, have access to a custom dashboard, be able to select activities, rate those activities, talk to other educators about what’s working, and more. Melissa is building all of that in Lightning with custom components, “I love that get to work some place that marries my passion for mission-based organizations with my passion for technology.”</p>\n<p>For more insights, make sure to follow Melissa on Twitter (<a href=\"https://twitter.com/MelissaPrcic\">@MelissaPrcic</a>)</p>\n<p>We want to get your suggestions for guests on the podcast, and we need your help! So tweet your guest suggestions, support, etc. to @SalesforceAdmns to help us get more Awesome Admins on the podcast.</p>\n<p>We want to remind you that if you love what you hear, or even if you don’t, head on over to Apple Podcasts and give us a review. It&#8217;s super easy to do, and it helps more Admins find the podcast. Plus, we would really appreciate it.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://admin.salesforce.com/using-salesforce-social-good-melissa-prcic\">Using Salesforce for Social Good with Melissa Prcic</a> appeared first on <a rel=\"nofollow\" href=\"https://admin.salesforce.com\">Salesforce Admins</a>.</p>\n"],"enclosure":[{"$":{"url":"http://traffic.libsyn.com/buttonclickadmin2/Using_Salesforce_for_Social_Good_with_Melissa_Prcic.mp3","length":"16660971","type":"audio/mpeg"}}],"itunes:subtitle":["Today on the Salesforce Admins Podcast we’re speaking with Melissa Prcic, a Developer at Stand for Children. Join us to hear about how she builds the technology behind Stand for Children’s anti-bullying efforts,"],"itunes:summary":["Today on the Salesforce Admins Podcast we’re speaking with Melissa Prcic, a Developer at Stand for Children. Join us to hear about how she builds the technology behind Stand for Children’s anti-bullying efforts, as well as her work on the steering committee for Rad Women, and her unique path to […]"],"itunes:author":["Mike Gerholdt & Gillian Bruce"],"itunes:explicit":["clean"],"itunes:duration":["33:20"]}