{"title":["101 | Your Top Idea, and Letting It Fester"],"guid":[{"_":"0d2e273e-b50e-4e0f-ac4f-fbd50b550766","$":{"isPermaLink":"false"}}],"link":["http://feedproxy.google.com/~r/FiveMinuteGeekShow/~3/brsAKyony7I/101"],"description":["What's at the top of your brain? And what's the benefit you get from having to wait on something, letting you brain roll over it?\r\n"],"content:encoded":["\r\n        <p>What's at the top of your brain? And what's the benefit you get from having to wait on something, letting you brain roll over it?</p>\n\n<ul>\n<li><a href=\"http://www.paulgraham.com/top.html\">Paul Graham - The Top Idea in Your Mind</a></li>\n</ul>\n\n\n<p>Transcript:</p>\n\n<p>Hi, I'm your host Matt Stauffer, and this episode 101 of The Five Minute Geek Show, a weekly show about development and everything around it. It's one topic per episode about front-end, back-end, mobile, project management, design, entrepreneurship, whatever. If it's geeky, it fits.</p>\n\n<p>Today, we're going to be talking about your top idea. I've talked about it a little bit in the past, but essentially, at any given moment, there's usually one primary thing that your brain returns to you when it gives a moment to rest. I often have about seven of these, which drives my wife nuts. We've talked often about the fact that I need to have less commitments. Not just because I need to be spending less time doing things, but because I need spaces for my brain to not only rest and have moments where I think about things family life related, not just all these kind of entrepreneurial and work ideas that I'm doing.</p>\n\n<p>So, essentially, when you have nothing else to do. When you're stuck in traffic, or when you are using the restroom, or showering, or taking a walk or something like that, your brain kind of rolls on to things. The things that your brain roll onto, often those are kind of like ... People frequently know this, are the things that ... We get some really great thinking done then, right? You've got stuck on something at work, and you go home and you sleep on it, and you come back and you have an answer. Or you go, you take a 15 minute walk.</p>\n\n<p>Sometimes you take a 15 minute walk, your brain just needs to re-orient itself. But sometimes ... For example, I'll often have an idea for an application or for a software of service, or for a project or a book or a blog post or a video. I'll have the idea long before I create the thing. I had an idea for a new product ... Not a product but that open-source thing that I want to do, like 11 months ago or something. Every once a while, it pops into my brain. It hasn't been the top of my mind, but it pops into my brain for a little bit. I think about it, and I think about one aspect of it, one nuance. Well, how would I get these people to carry the content here? Or, what would motivate somebody to want to carry the content here versus somewhere else? Or, how would I handle the fact that there's this type of data coming in there, but that type of data coming in there?</p>\n\n<p>So, it pops up every once in a while, and I kind of think about it for a little bit, and the thinking that I do there kind of moves into the storehouse of answers that I've come up with for those things. So, every single time I've ever created something of significance size, there's been years or at least many months of thinking about the thing prior to the point where I actually get started.</p>\n\n<p>So this thing, I bought a domain name for it three weeks ago, and I told everybody at Titan about it three weeks ago, but I've been thinking about the thing for months. I've been thinking about it even more frequently since then. It's nearly at the top idea of my mind kind of thing where most of my free time, I think, \"Well, okay, here's another thing I need to think about it.\" Then I think through it for a while, while I'm putting my daughter to sleep, or something like that.</p>\n\n<p>So it's interesting that there's not just this idea of the top idea in your mind. I've talked often with people about this top idea in your mind thing, Paul Graham's somebody who wrote something about it recently. It's not just the fact that you have one, which of course is an important conversation, because if you've never thought through these things, some of these important things about that are ... Like, if you're trying to split your job responsibility between multiple roles, there may be certain roles that never get to be the top idea in your brain, which means they never get that kind of free time thinking or that free moment thinking or that extra brain power that allows you to power through some things that might not happen during your normal, actual application of the job.</p>\n\n<p>Often I've told people who've wanted to do three things, I'm like, none of those three things are going to be done ... Or at least probably two of those three things are actually going to be done to a one-third attention level, because two of them are not going to be the forefront idea. So it's not even the time to spend on the thing, it's the time to spend thinking on the thing. So there's definitely things worth thinking about, just with regard to what is at the forefront of your mind.</p>\n\n<p>But what I want to talk about is giving space for yourself to process through the thing over time. It's almost as if ... So, okay, we did a developer battle. I think I'm going to get to my point eventually here. We did developer battle just recently between two of our senior developers. It's their first time doing this thing, where for a very short period of time, you don't know what the task is going to be ahead of you until you actually start, and everybody's watching you. There's all sorts of pressures. There's the pressure of typing while people are watching you, trying to come up with answers in a short amount of time. But one of the things that Keith, who's one of our developers, mentioned was that when he normally codes, he stops and he thinks things through, and he plans them out before he codes. He finds that he really struggled during the battle because he didn't do that. So he didn't have the thinking done prior to doing the coding, so he was trying to think and code at the same time.</p>\n\n<p>I think that's part of what it is here. For example, when I created Karani years ago, I'd had the idea in my head, and I actually even started writing some code for it several times. But what it really took was endless running. I hate running, but I do it because I try to stay healthy ... and endless running sessions where I'm seeing the same scenery pass by, and my brain just started wandering. I wandered to various use cases and features for Karani. I'd come back from my run and write some notes down. Or things where you wake up in the morning and you come up with a new idea. I think one of the benefits of Karani is that if I had taken Venture Capital, I didn't even know what it was at the time, and just had to build the whole thing, I really wouldn't have known what to build at first. It was the incremental building process of putting a little out there and then thinking on it.</p>\n\n<p>Honestly, not having enough time to work on a thing gives you more brain power. I wonder if there's actually a value to a constraint where you don't get to do the thing yet, and you need to do a little bit of thinking, a little bit of time sitting on it, and allowing yourself those little kind of thinking moments before you do the thing.</p>\n\n<p>It reminds me of a trip I took to Mexico City with a guy named Saul [inaudible 00:05:57] and you take two weeks there, and you're spending a whole bunch of time, American, middle-class, college educated kids, working with people in extreme poverty. What you want to do is you want to go in and fix things. That's what those types of trips are usually about. You go in and fix things, you feel better. He won't let you touch a thing for a least a week. First week, all you're allowed to do is learn and listen and get to know people. Only after you've had some time just kind of learning and listening and really hearing people and understanding a greater depth and nuance of their situation than I think would be normal for us to assume when you walk in with a broken roof. One, let me fix that roof.</p>\n\n<p>Only after at least a week, at least half your time of really developing relationships with people and hearing them say what they want and seeing their situations, and knowing what other circumstances there are that may influence it, does it even allow you to have any part in actually making a change. It's the same kind of thing.</p>\n\n<p>It can be headstrong. I had a thing recently where I felt very, very emotionally and passionately about a thing and wrote a big, long, kind of hairy email. I showed it to my partner Dan, and Dan said, \"Okay, cool, why don't you just kind of sit on it a little bit.\" It's always a good reminder. You know, sit on a bit and see how you feel about in a little bit. With emotional things, it's because you want to get out of the emotion and make sure you're still happy with how you represented yourself.</p>\n\n<p>But it's the same kind of thing, this, \"Okay, great, that's what you've got, but give your brain space to stretch in different directions. To be in a different mood and look at it, to be at a different frame of thinking and look at it, to allow something to bubble up in response to something else you see. You see a Tweet, and you say, \"Oh, you know what? That's one of the people I wanted to moderate the thing, and I just realized, why would they be motivated to use this thing?\" I had not actually considered the motivation of the moderators, and so now I need to figure out what changes can I make to my overall structure that makes these moderators want to actually be participating in? Obviously, this is the thing that I've been thinking about over the last year. It's just these various things that pop up in response to other stimuli.</p>\n\n<p>But if I had started building it the moment I had the idea, I wouldn't have had that kind of thinking process about the moderators. I just would've built it and would've said, \"Okay, moderators, come in\", and I never would've had that trigger to say, \"Wait a minute, you gotta make sure this is actually valuable for them to be a part of it.\" So, I know that the thing about the actual tool I'm talking about is super abstract here, but I think the goal ... There's not even a lesson, there's not even a message. It's just think about the value that comes from having to wait.</p>\n\n<p>There's value that comes from just letting your brain rest in the thing and stretch around the thing, and approach the thing from different angles, in different perspectives, before you actually get started on the thing. There may be formal ways to implement that, I'm not sure. But I don't know maybe I think that there's just some value for us to seeing value in that waiting in our work and in our processes.</p>\n\n<p>So, I don't know. I hope that's good. I hope so. Thanks for listening to The Five Minute Geek Show. We're back at Five Minute Geek Show and Twitter number five.</p>\n\n<p>FiveMinuteGeekShow.com, five. Subscribe to us at iTunes or RSS, if you like the show, share it with your friends, rate it in iTunes. Thanks! Till next time, Matt Stauffer, Five Minute Geek Show.</p>\n\r\n      "],"pubDate":["Fri, 07 Jul 2017 17:03:00 -0400"],"author":["matt@mattstauffer.co (Matt Stauffer)"],"itunes:author":["Matt Stauffer"],"itunes:image":[{"$":{"href":"https://media.simplecast.com/episode/image/75898/1499461602-artwork.jpg"}}],"itunes:duration":["00:09:18"],"itunes:summary":["What's at the top of your brain? And what's the benefit you get from having to wait on something, letting you brain roll over it?\r\n"],"itunes:subtitle":["What's at the top of your brain? And what's the benefit you get from having to wait on something, letting you brain roll over it?\r\n"],"itunes:keywords":[""],"itunes:explicit":["no"],"media:content":[{"$":{"url":"http://feedproxy.google.com/~r/FiveMinuteGeekShow/~5/Hz_tw_iWito/75898.mp3","fileSize":"8954927","type":"audio/mpeg"}}],"feedburner:origLink":["http://www.fiveminutegeekshow.com/101"],"enclosure":[{"$":{"url":"http://feedproxy.google.com/~r/FiveMinuteGeekShow/~5/Hz_tw_iWito/75898.mp3","length":"8954927","type":"audio/mpeg"}}],"feedburner:origEnclosureLink":["https://audio.simplecast.com/75898.mp3"]}