[
 {
   "Podcast Title": ".NET Rocks 3rd Place Winner of The 2016 Software Developer Podcast Awards",
   "Description": "An awesome and long running podcast by Carl Franklin and Richard Campbell.  It used to be primarily about .NET, but not it is much more diverse and covers a large variety of topics.<img  src=\"https://spzone-simpleprogrammer.netdna-ssl.com/wp-content/uploads/2017/01/award-winner-small-trophy-icon.png\" title=\"\" style=\"margin-bottom: -2px;\" alt=\"\" />"
 },
 {
   "Podcast Title": "Description\n An awesome and long running podcast by Carl Franklin and Richard Campbell.  It used to be primarily about .NET, but not it is much more diverse and covers a large variety of topics. Subscribe URL\n https://itunes.apple.com/us/podcast/channel-9/id73802611?mt=2 Episodes John Was On\n Show 1346, Leading Your Career \n http://www.dotnetrocks.com/default.aspx?showNum=1346\n Show 1088, talking about working on your career and soft skills.\n http://www.dotnetrocks.com/default.aspx?showNum=1088\n Show 980, talking about Managing Your Career\n http://www.dotnetrocks.com/default.aspx?showNum=980\n Show 887, talking about Google’s Dart language.\n http://www.dotnetrocks.com/default.aspx?showNum=887",
   "Description": ""
 },
 {
   "Podcast Title": "CodingBlocks.NET",
   "Description": "The world of computer programming is vast in scope. There are literally thousands of topics to cover and no one person could ever reach them all. One of the goals of the Coding Blocks podcast is to introduce a number of these topics to the audience so they can learn during their commute or while cutting the grass. We will cover topics such as best programming practices, design patterns, coding for performance, object oriented coding, database design and implementation, tips, tricks and a whole lot of other things."
 },
 {
   "Podcast Title": "Description\n The world of computer programming is vast in scope. There are literally thousands of topics to cover and no one person could ever reach them all. One of the goals of the Coding Blocks podcast is to introduce a number of these topics to the audience so they can learn during their commute or while cutting the grass. We will cover topics such as best programming practices, design patterns, coding for performance, object oriented coding, database design and implementation, tips, tricks and a whole lot of other things. Subscribe URL\n https://itunes.apple.com/us/podcast/coding-blocks-software-web/id769189585?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Hanselminutes",
   "Description": "Hanselminutes – Fresh Air for Developers is a weekly talk show that brings interesting people together to talk about the web, culture, education, technology and more. Hosted by Scott Hanselman, this show promises fresh ideas and great people."
 },
 {
   "Podcast Title": "Description\n Hanselminutes – Fresh Air for Developers is a weekly talk show that brings interesting people together to talk about the web, culture, education, technology and more. Hosted by Scott Hanselman, this show promises fresh ideas and great people. Subscribe URL\n https://itunes.apple.com/us/podcast/hanselminutes/id117488860?mt=2 Episodes John Was On\n Show 348 talking about ServiceStack\n http://hanselminutes.com/348/more-on-service-stack-with-john-sonmez\n 322 talking about fitness\n http://hanselminutes.com/322/getting-fit-with-programmer-john-sonmez\n 305 talking about Xamarin\n http://hanselminutes.com/305/monotouch-and-mono-for-android-with-trainer-john-sonmez",
   "Description": ""
 },
 {
   "Podcast Title": "Herding Code",
   "Description": "A weekly discussion featuring K. Scott Allen (odetocode.com), Kevin Dente, Scott Koon (lazycoder.com), and Jon Galloway."
 },
 {
   "Podcast Title": "Description\n A weekly discussion featuring K. Scott Allen (odetocode.com), Kevin Dente, Scott Koon (lazycoder.com), and Jon Galloway. Subscribe URL\n https://itunes.apple.com/us/podcast/herding-code/id284067914?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "MS Dev Show",
   "Description": "THE podcast for Microsoft developers. Jason Young and Carl Schweitzer talk about the latest in developer news covering topics such as the Azure cloud, Windows, Windows Phone, Visual Studio, and cross-platform development using the Microsoft platform."
 },
 {
   "Podcast Title": "Description\n THE podcast for Microsoft developers. Jason Young and Carl Schweitzer talk about the latest in developer news covering topics such as the Azure cloud, Windows, Windows Phone, Visual Studio, and cross-platform development using the Microsoft platform. Subscribe URL\n https://itunes.apple.com/us/podcast/ms-dev-show/id862879925?mt=2 Episodes John Was On\n Episode 44 talking about all the details software developers didn’t learn in school, creating DMZ in Azure, and the Joel Test for programmers\n http://msdevshow.com/2015/02/soft-skills-with-john-sonmez/",
   "Description": ""
 },
 {
   "Podcast Title": "Yet Another Podcast",
   "Description": "Programmers talking with programmers about Windows and Best Practices, as well as all things Geek."
 },
 {
   "Podcast Title": "Description\n Programmers talking with programmers about Windows and Best Practices, as well as all things Geek. Subscribe URL\n https://itunes.apple.com/us/podcast/yapcast-jesse-liberty/id393751871?mt=2 Episodes John Was On\n Show 113 talking about ServiceStack\n http://jesseliberty.com/2013/11/16/yet-another-podcast-113john-sonmezpluralsight-author-and-a-focus-on-servicestack/\n Show 145, talking about life and the pursuit of happiness\n http://jesseliberty.com/2015/12/29/yet-another-podcast-145-john-sonmez/",
   "Description": ""
 },
 {
   "Podcast Title": "Channel 9",
   "Description": "Channel 9 keeps you up to date with the latest news and behind the scenes info from Microsoft that developers love to keep up with. From LINQ to SilverLight – Watch videos and hear about all the cool technologies coming and the people behind them."
 },
 {
   "Podcast Title": "Description\n Channel 9 keeps you up to date with the latest news and behind the scenes info from Microsoft that developers love to keep up with. From LINQ to SilverLight – Watch videos and hear about all the cool technologies coming and the people behind them. Subscribe URL\n https://itunes.apple.com/us/podcast/channel-9/id73802611?mt=2",
   "Description": ""
 }
]