[
 {
   "Podcast Title": "The Debug Log Winner of The 2016 Software Developer Podcast Awards",
   "Description": "A podcast about game development. This is not your typical developer podcast. The Debug Log balances in-depth discussions and interviews with a casual and wry sense of humor. Join them each week as they deep dive into the evolving world of game development. <img  src=\"https://spzone-simpleprogrammer.netdna-ssl.com/wp-content/uploads/2017/01/award-winner-small-trophy-icon.png\" title=\"\" style=\"margin-bottom: -2px;\" alt=\"\" />"
 },
 {
   "Podcast Title": "Description\n A podcast about game development. This is not your typical developer podcast. The Debug Log balances in-depth discussions and interviews with a casual and wry sense of humor. Join them each week as they deep dive into the evolving world of game development. Subscribe URL\n https://itunes.apple.com/us/podcast/the-debug-log/id1019074514?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Game Dev Unchained",
   "Description": "Game industry veterans Brandon Pham and Larry Charles invite you to join us for our in depth, raw and unadulterated podcast about video game development."
 },
 {
   "Podcast Title": "Description\n Game industry veterans Brandon Pham and Larry Charles invite you to join us for our in depth, raw and unadulterated podcast about video game development. Subscribe URL\n https://itunes.apple.com/us/podcast/game-dev-unchained/id1043547750?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Indie Dev Podcast",
   "Description": "Each episode I interview and profile various independent game developers, so that we can get a peek behind the curtain and see how the magic is made."
 },
 {
   "Podcast Title": "Description\n Each episode I interview and profile various independent game developers, so that we can get a peek behind the curtain and see how the magic is made. Subscribe URL\n https://itunes.apple.com/us/podcast/indie-dev-podcast/id746942884?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "gamkedo.community",
   "Description": "The mission of Gamkedo Community is to share the personal stories and ways of thinking from developers with a wide range of experience levels, to convey a broader picture of what making games is like."
 },
 {
   "Podcast Title": "Description\n The mission of Gamkedo Community is to share the personal stories and ways of thinking from developers with a wide range of experience levels, to convey a broader picture of what making games is like.  Subscribe URL\n https://itunes.apple.com/us/podcast/gamkedo.community/id1006574766?mt=2",
   "Description": ""
 }
]