[
 {
   "Podcast Title": "The Changelog Winner of The 2016 Software Developer Podcast Awards",
   "Description": "A weekly podcast that shines a spotlight on the technology and people of open source. It's about the code, the people, and the community.&lt;img  src=\"https://spzone-simpleprogrammer.netdna-ssl.com/wp-content/uploads/2017/01/award-winner-small-trophy-icon.png\" title=\"\" style=\"margin-bottom: -2px;\" alt=\"\" /&gt;"
 },
 {
   "Podcast Title": "Description\n A weekly podcast that shines a spotlight on the technology and people of open source. It's about the code, the people, and the community. Subscribe URL\n https://itunes.apple.com/us/podcast/the-changelog/id341623264?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Simple Programmer Podcast",
   "Description": "John Sonmez wants to help you become more successful, make more money, deal with difficult coworkers and be so productive everyone thinks you must be abusing a prescription for Ritalin. Listen in every Monday, Wednesday and Friday, as Simple Programmer founder, John Sonmez, answers questions, interviews guests and shares everything he knows to help you become a top performing software developer. The Simple Programmer Podcast is a short podcast that is a mix of career advice, philosophy and soft skills from successful author and software developer, John Sonmez. John is the founder of http://simpleprogrammer.com, one of the most popular software development blogs, and the author of the best-selling book, \"Soft Skills: The Software Developer's Life Manual.\" (http://simpleprogrammer.com/softskills) Geared towards a programmer or software developer audience, but contains practical advice on: Career development Entrepreneurship Fitness Finance Productivity Personal development And more… That anyone can benefit from. Each episode is between 5 and 10 minutes long with at least 3 new episodes each week."
 },
 {
   "Podcast Title": "Description\n John Sonmez wants to help you become more successful, make more money, deal with difficult coworkers and be so productive everyone thinks you must be abusing a prescription for Ritalin. Listen in every Monday, Wednesday and Friday, as Simple Programmer founder, John Sonmez, answers questions, interviews guests and shares everything he knows to help you become a top performing software developer. The Simple Programmer Podcast is a short podcast that is a mix of career advice, philosophy and soft skills from successful author and software developer, John Sonmez. John is the founder of http://simpleprogrammer.com, one of the most popular software development blogs, and the author of the best-selling book, \"Soft Skills: The Software Developer's Life Manual.\" (http://simpleprogrammer.com/softskills) Geared towards a programmer or software developer audience, but contains practical advice on: Career development Entrepreneurship Fitness Finance Productivity Personal development And more… That anyone can benefit from. Each episode is between 5 and 10 minutes long with at least 3 new episodes each week. Subscribe URL\n https://itunes.apple.com/us/podcast/simple-programmer-podcast/id998357224 Episodes John Was On\n All of them!",
   "Description": ""
 },
 {
   "Podcast Title": "Get Up and CODE",
   "Description": "This podcast is all about fitness and nutrition with an IT slant. If you are interested in technology and fitness, this podcast might be exactly what you are looking for. The podcast started with John Sonmez and Iris Classon in 2013, two experienced developers as well as fitness geeks. In 2015 Robert Navarro started hosting the podcast after John Sonmez handed him the keys to the castle and allowed him to continue the tradition of helping others reach both their fitness and career goals. In this podcast they share all they know about getting in shape, losing weight, gaining muscle and eating right in their weekly discussion about all things fitness and nutrition. Want to know how to really get those 6 pack abs? Are carbs really bad for you? John and Iris answer all these questions and more in this short weekly podcast with about fitness and nutrition from engineering minds. Here is a short sampling for some of the topics discussed in this podcast:: fitness, nutrition, software development, programming, muscle, weight training, lifting, running, 5ks, marathons, jogging, workout, health, healthy living, aerobics, weight loss, exercise, diet, motivation."
 },
 {
   "Podcast Title": "Description\n This podcast is all about fitness and nutrition with an IT slant. If you are interested in technology and fitness, this podcast might be exactly what you are looking for. The podcast started with John Sonmez and Iris Classon in 2013, two experienced developers as well as fitness geeks. In 2015 Robert Navarro started hosting the podcast after John Sonmez handed him the keys to the castle and allowed him to continue the tradition of helping others reach both their fitness and career goals. In this podcast they share all they know about getting in shape, losing weight, gaining muscle and eating right in their weekly discussion about all things fitness and nutrition. Want to know how to really get those 6 pack abs? Are carbs really bad for you? John and Iris answer all these questions and more in this short weekly podcast with about fitness and nutrition from engineering minds. Here is a short sampling for some of the topics discussed in this podcast:: fitness, nutrition, software development, programming, muscle, weight training, lifting, running, 5ks, marathons, jogging, workout, health, healthy living, aerobics, weight loss, exercise, diet, motivation. Subscribe URL\n https://itunes.apple.com/us/podcast/get-up-and-code!/id646958161?mt=2 Episodes John Was On\n Just about all of them!",
   "Description": ""
 },
 {
   "Podcast Title": "Almost Better Than Silence",
   "Description": "A comedy podcast about video games that features technology news, guest interviews, and conversation games!"
 },
 {
   "Podcast Title": "Description\n A comedy podcast about video games that features technology news, guest interviews, and conversation games! Subscribe URL\n https://itunes.apple.com/us/podcast/almost-better-than-silence/id953967760?mt=2 Episodes John Was On\n Episode 18 talking about Soft Skills and marketing yourself as a software developer and we play a conversation game!\n http://almostbetterthansilence.com/2015/03/abts-018-john-sonmez-interview/\n Episode 96, to have more fun\n http://almostbetterthansilence.com/2016/03/abts-096-entreprogrammers-stop/",
   "Description": ""
 },
 {
   "Podcast Title": "Away from the KeyBoard",
   "Description": "Away From The Keyboard is where technologists tell their stories of how they started, how they grew, how they learned, and how they unwind. Hosted by software developers Cecil Phillip and Richie Rump, Away From The Keyboard looks at the human side of technology in a fun and informative way. New episodes are released every Tuesday."
 },
 {
   "Podcast Title": "Description\n Away From The Keyboard is where technologists tell their stories of how they started, how they grew, how they learned, and how they unwind. Hosted by software developers Cecil Phillip and Richie Rump, Away From The Keyboard looks at the human side of technology in a fun and informative way. New episodes are released every Tuesday. Subscribe URL\n https://itunes.apple.com/us/podcast/away-from-the-keyboard/id987544504?mt=2 Episodes John Was On\n Episode 2: John Sonmez Makes It Simple\n http://awayfromthekeyboard.com/2015/04/28/episode-2-john-sonmez-makes-it-simple/",
   "Description": ""
 },
 {
   "Podcast Title": "CodeNewbie",
   "Description": "Stories from people on their coding journey."
 },
 {
   "Podcast Title": "Description\n Stories from people on their coding journey. Subscribe URL\n https://itunes.apple.com/us/podcast/codenewbie/id919219256?mt=2 Episodes John Was On\n Ep. 109 Simple Programmer\n http://www.codenewbie.org/podcast/simple-programmer",
   "Description": ""
 },
 {
   "Podcast Title": "Coder Radio",
   "Description": "A weekly talk show taking a pragmatic look at the art and business of Software Development and related technologies."
 },
 {
   "Podcast Title": "Description\n A weekly talk show taking a pragmatic look at the art and business of Software Development and related technologies. Subscribe URL\n https://itunes.apple.com/us/podcast/coder-radio-mp3/id534941512?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Developer on Fire",
   "Description": "Developer On Fire with Dave Rael is an interview podcast with inspiring and successful software professionals telling personal stories about their experiences with delivering value. It is a chance for you to get to know your favorite geeks and learn more about who they are, how they deliver, and what makes them tick. Learn from and get to know special geeks like Matt Wynne, Rob Eisenberg, Udi Dahan, Ted Neward, John Sonmez, Phil Haack, and David Heinemeier Hansson."
 },
 {
   "Podcast Title": "Description\n Developer On Fire with Dave Rael is an interview podcast with inspiring and successful software professionals telling personal stories about their experiences with delivering value. It is a chance for you to get to know your favorite geeks and learn more about who they are, how they deliver, and what makes them tick. Learn from and get to know special geeks like Matt Wynne, Rob Eisenberg, Udi Dahan, Ted Neward, John Sonmez, Phil Haack, and David Heinemeier Hansson. Subscribe URL\n https://itunes.apple.com/us/podcast/developer-on-fire/id1006105326?mt=2 Episodes John Was On\n Episode 001 | John Sonmez: Simple Programmer\n http://developeronfire.com/episode-001-john-sonmez-simple-programmer",
   "Description": ""
 },
 {
   "Podcast Title": "Developer Tea",
   "Description": "A 10 minute podcast for developers! Developer Tea is engineered to be a highly-concentrated, short, frequent podcast specifically for developers who like to learn on their tea (and coffee) break."
 },
 {
   "Podcast Title": "Description\n A 10 minute podcast for developers! Developer Tea is engineered to be a highly-concentrated, short, frequent podcast specifically for developers who like to learn on their tea (and coffee) break. Subscribe URL\n https://itunes.apple.com/us/podcast/developer-tea/id955596067?mt=2 Episodes John Was On\n Episodes, 21 and 22 talking about being the top 1% of developers\n http://spec.fm/podcasts/developer-tea/7976",
   "Description": ""
 },
 {
   "Podcast Title": "FLOSS Weekly",
   "Description": "We're not talking dentistry here; FLOSS all about Free Libre Open Source Software. Join host Randal Schwartz and his rotating panel of co-hosts every Tuesday as they talk with the most interesting and important people in the Open Source and Free Software community. Records live at https://twit.tv/live every Tuesday at 12:30pm Eastern / 9:30am Pacific / 17:30 UTC."
 },
 {
   "Podcast Title": "Description\n We're not talking dentistry here; FLOSS all about Free Libre Open Source Software. Join host Randal Schwartz and his rotating panel of co-hosts every Tuesday as they talk with the most interesting and important people in the Open Source and Free Software community. Records live at https://twit.tv/live every Tuesday at 12:30pm Eastern / 9:30am Pacific / 17:30 UTC. Subscribe URL\n https://itunes.apple.com/us/podcast/floss-weekly-mp3/id140847216?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Hello World Podcast",
   "Description": "Not just another technical podcast. Shawn Wildermuth brings you his \"Hello World\" podcast where we learn about how your favorite developers tell their story of how they got started writing software!"
 },
 {
   "Podcast Title": "Description\n Not just another technical podcast. Shawn Wildermuth brings you his \"Hello World\" podcast where we learn about how your favorite developers tell their story of how they got started writing software! Subscribe URL\n https://itunes.apple.com/us/podcast/the-hello-world-podcast/id768018561?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "No Dogma Podcast",
   "Description": "Discussions on topics connected with software development; privacy, security, management, tools, techniques, skills, training, business"
 },
 {
   "Podcast Title": "Description\n Discussions on topics connected with software development; privacy, security, management, tools, techniques, skills, training, business Subscribe URL\n https://itunes.apple.com/us/podcast/no-dogma-podcast/id912568441?mt=2 Episodes John Was On\n Episode 35, talking about my book Soft Skills\n http://nodogmapodcast.bryanhogan.net/35-john-sonmez-soft-skills/",
   "Description": ""
 },
 {
   "Podcast Title": "Software Engineering Radio",
   "Description": "Software Engineering Radio is a podcast targeted at the professional software developer. The goal is to be a lasting educational resource, not a newscast. Every 10 days, a new episode is published that covers all topics software engineering. Episodes are either tutorials on a specific topic, or an interview with a well-known character from the software engineering world. All SE Radio episodes are original content — we do not record conferences or talks given in other venues. Each episode comprises two speakers to ensure a lively listening experience. SE Radio is an independent and non-commercial organization."
 },
 {
   "Podcast Title": "Description\n Software Engineering Radio is a podcast targeted at the professional software developer. The goal is to be a lasting educational resource, not a newscast. Every 10 days, a new episode is published that covers all topics software engineering. Episodes are either tutorials on a specific topic, or an interview with a well-known character from the software engineering world. All SE Radio episodes are original content — we do not record conferences or talks given in other venues. Each episode comprises two speakers to ensure a lively listening experience. SE Radio is an independent and non-commercial organization. Subscribe URL\n https://itunes.apple.com/us/podcast/software-engineering-radio/id120906714?mt=2 Episodes John Was On\n Episode 245, talking about marketing yourself and managing your career\n http://www.se-radio.net/2015/12/se-radio-episode-245-john-sonmez-on-marketing-yourself-and-managing-your-career/",
   "Description": ""
 },
 {
   "Podcast Title": "Eat Sleep Code Podcast",
   "Description": "On the show we’ll be talking to passionate people about a wide range of developer related topics. Part of the Telerik Developer Network , Eat Sleep Code is the Official Telerik Podcast. At Telerik we believe in giving back to the developer community and we do this by writing, speaking and staying in touch with the software development community."
 },
 {
   "Podcast Title": "Description\n On the show we’ll be talking to passionate people about a wide range of developer related topics. Part of the Telerik Developer Network , Eat Sleep Code is the Official Telerik Podcast. At Telerik we believe in giving back to the developer community and we do this by writing, speaking and staying in touch with the software development community. Subscribe URL\n https://itunes.apple.com/us/podcast/eat-sleep-code-podcast/id1015556393?mt=2 Episodes John Was On\n Talking about soft skills\n http://developer.telerik.com/topics/developer-soft-skills-with-john-sonmez/",
   "Description": ""
 },
 {
   "Podcast Title": "Scale Your Code",
   "Description": "This podcast asks technical and philosophical questions to programmers who have put in the 10,000+ hours of hard work so that you can learn from their mistakes and successes. Topics include but are not limited to: scaling web apps to millions of users, securing servers, automation, building APIs, building WordPress plugins, JavaScript, etc…"
 },
 {
   "Podcast Title": "Description\n This podcast asks technical and philosophical questions to programmers who have put in the 10,000+ hours of hard work so that you can learn from their mistakes and successes. Topics include but are not limited to: scaling web apps to millions of users, securing servers, automation, building APIs, building WordPress plugins, JavaScript, etc… Subscribe URL\n https://itunes.apple.com/us/podcast/scale-your-code-podcast/id987253051?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Complete Developer Podcast",
   "Description": "There are plenty of podcasts out there about languages and coding. What we are doing with the Complete Developer Podcast is to cover the other areas of life. For example, our first episode is about talking with customers, bosses, and others that developers interact with who are not fellow developers."
 },
 {
   "Podcast Title": "Description\n There are plenty of podcasts out there about languages and coding. What we are doing with the Complete Developer Podcast is to cover the other areas of life. For example, our first episode is about talking with customers, bosses, and others that developers interact with who are not fellow developers. Subscribe URL\n https://itunes.apple.com/us/podcast/complete-developer-podcast/id1039210992?mt=2 Episodes John Was On\n Episode 60: Overcoming Social Awkwardness\n http://completedeveloperpodcast.com/episode-60/",
   "Description": ""
 },
 {
   "Podcast Title": "Software Engineering Daily",
   "Description": "Software Engineering Daily features daily interviews about technical software topics."
 },
 {
   "Podcast Title": "Description\n Software Engineering Daily features daily interviews about technical software topics. Subscribe URL\n https://itunes.apple.com/us/podcast/software-engineering-daily/id1019576853?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Merge Conflict",
   "Description": "A weekly discussion on all things development, technology, & more. Available every Monday from 7am GMT."
 },
 {
   "Podcast Title": "Description\n A weekly discussion on all things development, technology, & more. Available every Monday from 7am GMT. Subscribe URL\n https://itunes.apple.com/us/podcast/merge-conflict/id1133064277?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Five-Minute Geek Show",
   "Description": "Matt Stauffer, unabashedly geeky, 5 minutes, twice a week. Frontend dev, backend dev, audio, design, podcasts–all fair game."
 },
 {
   "Podcast Title": "Description\n Matt Stauffer, unabashedly geeky, 5 minutes, twice a week. Frontend dev, backend dev, audio, design, podcasts–all fair game. Subscribe URL\n https://itunes.apple.com/us/podcast/the-five-minute-geek-show/id952727637?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Full Stack Radio",
   "Description": "A podcast for developers interested in building great software products. Every episode, Adam Wathan is joined by a guest to talk about everything from product design and user experience to unit testing and system administration."
 },
 {
   "Podcast Title": "Description\n A podcast for developers interested in building great software products. Every episode, Adam Wathan is joined by a guest to talk about everything from product design and user experience to unit testing and system administration. Subscribe URL\n https://itunes.apple.com/us/podcast/full-stack-radio/id931714873?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Bike Shed",
   "Description": "On The Bike Shed, hosts Derek Prior, Sean Griffin, Laila Winner, and guests discuss their development experience and challenges with Ruby, Rails, JavaScript, and whatever else is drawing their attention, admiration, or ire this week."
 },
 {
   "Podcast Title": "Description\n On The Bike Shed, hosts Derek Prior, Sean Griffin, Laila Winner, and guests discuss their development experience and challenges with Ruby, Rails, JavaScript, and whatever else is drawing their attention, admiration, or ire this week. Subscribe URL\n https://itunes.apple.com/us/podcast/the-bike-shed/id935763119?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The New Stack Makers",
   "Description": "A new interview each weekday, The New Stack's stream of featured speakers and interviews is all about the new software stacks that change the way we development and deploy software. For The New Stack Analysts podcast, please see https://soundcloud.com/thenewstack. For The New Stack @ Scale podcast, please see https://soundcloud.com/thenewstackatscale"
 },
 {
   "Podcast Title": "Description\n A new interview each weekday, The New Stack's stream of featured speakers and interviews is all about the new software stacks that change the way we development and deploy software. For The New Stack Analysts podcast, please see https://soundcloud.com/thenewstack. For The New Stack @ Scale podcast, please see https://soundcloud.com/thenewstackatscale Subscribe URL\n https://itunes.apple.com/us/podcast/the-new-stack-makers/id915443155?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The New Stack Analysts",
   "Description": "Alex Williams, founder of The New Stack, hosts \"The New Stack Analysts,\" a weekly round-table discussion covering The New Stack's latest data research, and topics related to app development and back-end services. For The New Stack @ Scale podcast, please see https://soundcloud.com/thenewstackatscale For The New Stack Makers stream, please see https://soundcloud.com/thenewstackmakers"
 },
 {
   "Podcast Title": "Description\n Alex Williams, founder of The New Stack, hosts \"The New Stack Analysts,\" a weekly round-table discussion covering The New Stack's latest data research, and topics related to app development and back-end services. For The New Stack @ Scale podcast, please see https://soundcloud.com/thenewstackatscale For The New Stack Makers stream, please see https://soundcloud.com/thenewstackmakers Subscribe URL\n https://itunes.apple.com/us/podcast/the-new-stack-analysts/id915466036?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Software Defined Talk",
   "Description": "We discuss the fun, changing land of the software stack and how we're being defined by it."
 },
 {
   "Podcast Title": "Description\n We discuss the fun, changing land of the software stack and how we're being defined by it. Subscribe URL\n https://itunes.apple.com/us/podcast/software-defined-talk/id893738521?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Dane and The Pain",
   "Description": "Aussie Lars Klint (The Dane) and Alaskan Joel Jackson (The Pain) discuss the world of technology and how it relates to the real world. With a passion for all gadgets, nothing is sacred. Any topic is treated with the same level of curiosity, ignorance and blatant disregard for the Swedish."
 },
 {
   "Podcast Title": "Description\n Aussie Lars Klint (The Dane) and Alaskan Joel Jackson (The Pain) discuss the world of technology and how it relates to the real world. With a passion for all gadgets, nothing is sacred. Any topic is treated with the same level of curiosity, ignorance and blatant disregard for the Swedish. Subscribe URL\n https://itunes.apple.com/ca/podcast/the-dane-and-the-pain/id918842620?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Course Report",
   "Description": "Podcast from coding bootcamp directory that includes interviews with developers attending various bootcamps, and monthly news roundups– from new bootcamps to fundraising announcements, to controversy and interesting developer trends."
 },
 {
   "Podcast Title": "Description\n Podcast from coding bootcamp directory that includes interviews with developers attending various bootcamps, and monthly news roundups– from new bootcamps to fundraising announcements, to controversy and interesting developer trends. Subscribe URL\n https://itunes.apple.com/us/podcast/course-report/id984646882?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Cynical Developer",
   "Description": "The podcast that helps you to understand why you should be using the latest and greatest in development technologies."
 },
 {
   "Podcast Title": "Description\n The podcast that helps you to understand why you should be using the latest and greatest in development technologies. Subscribe URL\n https://itunes.apple.com/gb/podcast/the-cynical-developer/id1169160766?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Hello Tech Pros",
   "Description": "Why do many people in technology excel at technical skills but struggle with soft skills? Both are needed to truly exceed. This day-by-day ritual will help you get clear on your goals, develop more relationships, grow your career and launch your business. Join Chad and his featured guest as they take on each of these topics every week: Motivation Monday, Productivity Tuesday, Leadership Wednesday, Technology Thursday, People Friday, Entrepreneurship Saturday and Being Unplugged Sunday."
 },
 {
   "Podcast Title": "Description\n Why do many people in technology excel at technical skills but struggle with soft skills? Both are needed to truly exceed. This day-by-day ritual will help you get clear on your goals, develop more relationships, grow your career and launch your business. Join Chad and his featured guest as they take on each of these topics every week: Motivation Monday, Productivity Tuesday, Leadership Wednesday, Technology Thursday, People Friday, Entrepreneurship Saturday and Being Unplugged Sunday. Subscribe URL\n https://itunes.apple.com/us/podcast/hello-tech-pros-daily-soft/id1099720546?mt=2 Episodes John Was On\n Treat Your Career as a Business Even If You Have Only One Customer\n http://hellotechpros.com/john-sonmez-people/",
   "Description": ""
 },
 {
   "Podcast Title": "Learn to Code With Me",
   "Description": "The Learn to Code With Me podcast, created by Laurence Bradford, is for aspiring techies and self-taught coders looking to transition into the tech industry. Want actionable insights on how you can get paid for your coding skills? Then you're in the right place!"
 },
 {
   "Podcast Title": "Description\n The Learn to Code With Me podcast, created by Laurence Bradford, is for aspiring techies and self-taught coders looking to transition into the tech industry. Want actionable insights on how you can get paid for your coding skills? Then you're in the right place! Subscribe URL\n https://itunes.apple.com/us/podcast/learn-to-code-with-me/id1106620664?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Versioning Show",
   "Description": "This is a show where we get together to discuss the industry of the web, from development to design, with some of the people making it happen today, and planning where it's headed in the next version."
 },
 {
   "Podcast Title": "Description\n This is a show where we get together to discuss the industry of the web, from development to design, with some of the people making it happen today, and planning where it's headed in the next version. Subscribe URL\n https://itunes.apple.com/us/podcast/the-versioning-show/id1135300597?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Lock Me Down",
   "Description": "There is a rich and engaging mystery behind every company security breach or hacker's escapades. The Lock Me Down podcast delivers those stories from a story tellers perspective while also empowering the everyday developer to write more secure software. Whether you’re looking to expand your software security skills, or just looking for that next captivating caper, the Lock Me Down podcast aims to deliver."
 },
 {
   "Podcast Title": "Description\n There is a rich and engaging mystery behind every company security breach or hacker's escapades. The Lock Me Down podcast delivers those stories from a story tellers perspective while also empowering the everyday developer to write more secure software. Whether you’re looking to expand your software security skills, or just looking for that next captivating caper, the Lock Me Down podcast aims to deliver. Subscribe URL\n https://itunes.apple.com/us/podcast/id1068646369?i=1000379217342&mt=2",
   "Description": ""
 }
]