[
 {
   "Podcast Title": "JavaScript Jabber Winner of The 2016 Software Developer Podcast Awards",
   "Description": "A weekly podcast about JavaScript, including Node.js, front-end technologies, careers, teams and more. <img  src=\"https://spzone-simpleprogrammer.netdna-ssl.com/wp-content/uploads/2017/01/award-winner-small-trophy-icon.png\" title=\"\" style=\"margin-bottom: -2px;\" alt=\"\" />"
 },
 {
   "Podcast Title": "Description\n A weekly podcast about JavaScript, including Node.js, front-end technologies, careers, teams and more. Subscribe URL\n https://itunes.apple.com/us/podcast/javascript-jabber/id496893300?mt=2 Episodes John Was On\n Episode 156 talking about Soft Skills and marketing yourself as a software developer\n http://devchat.tv/js-jabber/156-jsj-soft-skills-and-marketing-yourself-as-a-software-developer-with-john-sonmez\n 233 JSJ Google Chrome Extensions with John Sonmez\n https://devchat.tv/js-jabber/233-jsj-google-chrome-extensions-with-john-sonmez",
   "Description": ""
 },
 {
   "Podcast Title": "Adventures in Angular",
   "Description": "Adventures in Angular is a weekly podcast about developments in the Angular community, tools, techniques, and ecosystem."
 },
 {
   "Podcast Title": "Description\n Adventures in Angular is a weekly podcast about developments in the Angular community, tools, techniques, and ecosystem. Subscribe URL\n https://itunes.apple.com/us/podcast/adventures-in-angular/id907361052?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Back to Front Show",
   "Description": "The Back to Front show was started in 2013 by web industry veterans Keir Whitaker and Kieran Masterton. Over the first 40 episodes they have discussed everything from web design and development to startups and dog related tech. Today the focus has shifted and includes topics including remote working, working in the web industry, productivity, hipster beards and much more. Released irregularly but always produced with passion The Back to Front Show runs for around 40 minutes per episode and comes to you from the beautiful West Country in the UK. Thanks for listening."
 },
 {
   "Podcast Title": "Description\n The Back to Front show was started in 2013 by web industry veterans Keir Whitaker and Kieran Masterton. Over the first 40 episodes they have discussed everything from web design and development to startups and dog related tech. Today the focus has shifted and includes topics including remote working, working in the web industry, productivity, hipster beards and much more. Released irregularly but always produced with passion The Back to Front Show runs for around 40 minutes per episode and comes to you from the beautiful West Country in the UK. Thanks for listening. Subscribe URL\n https://itunes.apple.com/gb/podcast/the-back-to-front-show/id594631752?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Big Web Show",
   "Description": "The award winning Big Web Show features special guests and topics like web publishing, art direction, content strategy, typography, web technology, and more. It’s everything web that matters."
 },
 {
   "Podcast Title": "Description\n The award winning Big Web Show features special guests and topics like web publishing, art direction, content strategy, typography, web technology, and more. It’s everything web that matters. Subscribe URL\n https://itunes.apple.com/us/podcast/the-big-web-show/id370445683?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Boagworld Show",
   "Description": "Boagworld is a podcast about digital strategy, management and user experience. It offers practical advice, news, tools, review and interviews with leading figures in the web design community. Covering everything from usability and design to marketing and strategy, this show has something for everything. This award winning podcast is the longest running web design podcast with over 380 episodes."
 },
 {
   "Podcast Title": "Description\n Boagworld is a podcast about digital strategy, management and user experience. It offers practical advice, news, tools, review and interviews with leading figures in the web design community. Covering everything from usability and design to marketing and strategy, this show has something for everything. This award winning podcast is the longest running web design podcast with over 380 episodes. Subscribe URL\n https://itunes.apple.com/us/podcast/the-boagworld-ux-show/id411449225?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "CTRL+CLICK CAST",
   "Description": "CTRL+CLICK CAST inspects the web for you! We proudly feature diverse voices from the industry’s leaders and innovators, who tackle everything from design, code and content management systems, to culture and business challenges. Our focused, topical discussions teach, inspire and waste no time getting to the heart of the matter. Formerly the EE Podcast, CTRL+CLICK is produced by Bright Umbrella and hosted by industry veterans Lea Alcantara and Emily Lewis."
 },
 {
   "Podcast Title": "Description\n CTRL+CLICK CAST inspects the web for you! We proudly feature diverse voices from the industry’s leaders and innovators, who tackle everything from design, code and content management systems, to culture and business challenges. Our focused, topical discussions teach, inspire and waste no time getting to the heart of the matter. Formerly the EE Podcast, CTRL+CLICK is produced by Bright Umbrella and hosted by industry veterans Lea Alcantara and Emily Lewis. Subscribe URL\n https://itunes.apple.com/us/podcast/ctrl+click-cast/id446900959?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "NodeUp",
   "Description": "NodeUp is a podcast about Node.js"
 },
 {
   "Podcast Title": "Description\n NodeUp is a podcast about Node.js Subscribe URL\n https://itunes.apple.com/us/podcast/nodeup/id447667314?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Shop Talk",
   "Description": "ShopTalk is a podcast about front end web design, development and UX. Each week Chris Coyier and Dave Rupert are joined by a special guest to talk shop and answer listener submitted questions."
 },
 {
   "Podcast Title": "Description\n ShopTalk is a podcast about front end web design, development and UX. Each week Chris Coyier and Dave Rupert are joined by a special guest to talk shop and answer listener submitted questions. Subscribe URL\n https://itunes.apple.com/us/podcast/shoptalk/id493890455?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Web Ahead",
   "Description": "Conversations with world experts on changing technologies and future of the web. The Web Ahead is your shortcut to keeping up. Hosted by Jen Simmons."
 },
 {
   "Podcast Title": "Description\n Conversations with world experts on changing technologies and future of the web. The Web Ahead is your shortcut to keeping up. Hosted by Jen Simmons. Subscribe URL\n https://itunes.apple.com/us/podcast/the-web-ahead/id464936442?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "FiveJS",
   "Description": "About the latest news in the JavaScript community and all less than 5 minutes in length, produced by Code School."
 },
 {
   "Podcast Title": "Description\n About the latest news in the JavaScript community and all less than 5 minutes in length, produced by Code School. Subscribe URL\n https://itunes.apple.com/us/podcast/5-minutes-of-javascript/id775261328?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Start Here FM",
   "Description": "An informative and up-to-date podcast on creating a business with Web Development."
 },
 {
   "Podcast Title": "Description\n An informative and up-to-date podcast on creating a business with Web Development. Subscribe URL\n https://itunes.apple.com/us/podcast/start-here-web-development/id898026456?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "JavaScript Air",
   "Description": "JavaScript Air is a live video broadcast podcast all about JavaScript. After the show, it is made available on YouTube and the audio is available on iTunes and as part of an RSS feed."
 },
 {
   "Podcast Title": "Description\n JavaScript Air is a live video broadcast podcast all about JavaScript. After the show, it is made available on YouTube and the audio is available on iTunes and as part of an RSS feed. Subscribe URL\n https://itunes.apple.com/us/podcast/javascript-air/id1066446588?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The Web Platform Podcast",
   "Description": "The Web Platform Podcast is a developer discussion that dives deep into ‘all things’ web. We discuss everything from developing for mobile to building HDTV software. From wearables & robotics to user experience & mentoring, we bring to our listeners everything related to building products & services for The Web Platform of today, tomorrow, and beyond."
 },
 {
   "Podcast Title": "Description\n The Web Platform Podcast is a developer discussion that dives deep into ‘all things’ web. We discuss everything from developing for mobile to building HDTV software. From wearables & robotics to user experience & mentoring, we bring to our listeners everything related to building products & services for The Web Platform of today, tomorrow, and beyond. Subscribe URL\n https://itunes.apple.com/us/podcast/the-web-platform-podcast/id899384794?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Relative Paths",
   "Description": "This is a UK based podcast for web industry types."
 },
 {
   "Podcast Title": "Description\n This is a UK based podcast for web industry types. Subscribe URL\n https://itunes.apple.com/gb/podcast/relative-paths-web-development/id914858338?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Design vs Dev",
   "Description": "A podcast about web development from the different perspectives of designers and developers. We help developers be better at design, and designers be better at development. Design vs Dev is brought to you by The Agile League, a web development agency based in Atlanta, GA specializing in Ruby on Rails, web design, and Ember.js"
 },
 {
   "Podcast Title": "Description\n A podcast about web development from the different perspectives of designers and developers. We help developers be better at design, and designers be better at development. Design vs Dev is brought to you by The Agile League, a web development agency based in Atlanta, GA specializing in Ruby on Rails, web design, and Ember.js Subscribe URL\n https://itunes.apple.com/gb/podcast/design-vs-dev/id910008025?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Angular Air",
   "Description": "Angular Air is a video podcast all about AngularJS and Angular 2 hosted by AngularClass"
 },
 {
   "Podcast Title": "Description\n Angular Air is a video podcast all about AngularJS and Angular 2 hosted by AngularClass Subscribe URL\n https://itunes.apple.com/us/podcast/angular-air/id940806858?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "A Responsive Web Design Podcast",
   "Description": "A podcast from Karen McGrane and Ethan Marcotte, who interview people who make responsive designs happen."
 },
 {
   "Podcast Title": "Description\n A podcast from Karen McGrane and Ethan Marcotte, who interview people who make responsive designs happen. Subscribe URL\n https://itunes.apple.com/us/podcast/responsive-web-design-podcast/id910013523?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Front End Happy Hour",
   "Description": "A podcast featuring panelists of engineers from Netflix, Evernote & LinkedIn talking over drinks about all things Front End development."
 },
 {
   "Podcast Title": "Description\n A podcast featuring panelists of engineers from Netflix, Evernote & LinkedIn talking over drinks about all things Front End development. Subscribe URL\n https://itunes.apple.com/us/podcast/front-end-happy-hour/id1089047924?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Modern Web",
   "Description": "Modern Web is a podcast that covers the latest news on topics such as EmberJS, ReactJS, AngularJS, ES2015, RxJS, Functional Reactive Programming, and more."
 },
 {
   "Podcast Title": "Description\n Modern Web is a podcast that covers the latest news on topics such as EmberJS, ReactJS, AngularJS, ES2015, RxJS, Functional Reactive Programming, and more. Subscribe URL\n https://itunes.apple.com/us/podcast/modern-web/id1084236187?mt=2",
   "Description": ""
 }
]