[
 {
   "Podcast Title": "Xamarin Podcast Winner of The 2016 Software Developer Podcast Awards",
   "Description": "The home of the official Xamarin Podcast, bringing mobile developers the latest news and information about Xamarin and mobile development. Views and opinions expressed in these podcasts do not reflect the views, opinions, or policies of Xamarin Inc. <img  src=\"https://spzone-simpleprogrammer.netdna-ssl.com/wp-content/uploads/2017/01/award-winner-small-trophy-icon.png\" title=\"\" style=\"margin-bottom: -2px;\" alt=\"\" />"
 },
 {
   "Podcast Title": "Description\n The home of the official Xamarin Podcast, bringing mobile developers the latest news and information about Xamarin and mobile development. Views and opinions expressed in these podcasts do not reflect the views, opinions, or policies of Xamarin Inc. Subscribe URL\n https://itunes.apple.com/us/podcast/xamarin-podcast/id691368176?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Accidental Tech Podcast",
   "Description": "Three nerds discussing tech, Apple, programming, and loosely related matters."
 },
 {
   "Podcast Title": "Description\n Three nerds discussing tech, Apple, programming, and loosely related matters. Subscribe URL\n https://itunes.apple.com/us/podcast/accidental-tech-podcast/id617416468?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Android Developers Backstage",
   "Description": "Android Backstage, a podcast by and for Android developers. Hosted by developers from the Android engineering team, this show covers topics of interest to Android programmers, with in-depth discussions and interviews with engineers on the Android team at Google."
 },
 {
   "Podcast Title": "Description\n Android Backstage, a podcast by and for Android developers. Hosted by developers from the Android engineering team, this show covers topics of interest to Android programmers, with in-depth discussions and interviews with engineers on the Android team at Google. Subscribe URL\n http://feeds.feedburner.com/blogspot/AndroidDevelopersBackstage",
   "Description": ""
 },
 {
   "Podcast Title": "App Masters",
   "Description": "Want to build a top 10 mobile app or game? Learn from the top mobile app developers in the space as they share tips and tricks on how they built their business. Topics range from mobile marketing to mobile game development to mobile services. If you want to succeed in the mobile space, this podcast delivers invaluable lessons from successful mobile entrepreneurs."
 },
 {
   "Podcast Title": "Description\n Want to build a top 10 mobile app or game? Learn from the top mobile app developers in the space as they share tips and tricks on how they built their business. Topics range from mobile marketing to mobile game development to mobile services. If you want to succeed in the mobile space, this podcast delivers invaluable lessons from successful mobile entrepreneurs. Subscribe URL\n https://itunes.apple.com/us/podcast/appmasters.co-app-marketing/id643216602?mt=2 Episodes John Was On\n Talking about how to market yourself\n http://www.appmasters.co/simple-programmer-john-sonmez/\n Episode 24 talking about how finishing my first mobile app was a turning point in my career\n http://www.appbizdev.com/2015/01/episode-24-big-finish.html",
   "Description": ""
 },
 {
   "Podcast Title": "Core Intuition",
   "Description": "Daniel Jalkut and Manton Reece discuss Mac programming, independent development, Apple news, and more."
 },
 {
   "Podcast Title": "Description\n Daniel Jalkut and Manton Reece discuss Mac programming, independent development, Apple news, and more. Subscribe URL\n https://itunes.apple.com/podcast/core-intuition/id281777685?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Under the Radar",
   "Description": "From development and design to marketing and support, Under the Radar is all about independent app development. It's never longer than 30 minutes. Hosted by David Smith and Marco Arment."
 },
 {
   "Podcast Title": "Description\n From development and design to marketing and support, Under the Radar is all about independent app development. It's never longer than 30 minutes. Hosted by David Smith and Marco Arment. Subscribe URL\n https://itunes.apple.com/gb/podcast/under-the-radar/id1055685246?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Gone Mobile",
   "Description": "Gone Mobile is a podcast discussing the latest in mobile development, with a healthy bias towards Xamarin technologies. The podcast covers in-depth topics with guests ranging from Android, iOS, Windows Phone & Store development to mobile marketing and design, as well as other mobile or not so mobile related technologies."
 },
 {
   "Podcast Title": "Description\n Gone Mobile is a podcast discussing the latest in mobile development, with a healthy bias towards Xamarin technologies. The podcast covers in-depth topics with guests ranging from Android, iOS, Windows Phone & Store development to mobile marketing and design, as well as other mobile or not so mobile related technologies. Subscribe URL\n https://itunes.apple.com/us/podcast/gone-mobile-podcast/id698794070?mt=2 Episodes John Was On\n Episode 9 talking about how to market yourself and how mobile development can help you do it\n http://gonemobile.io/blog/e0009-marketing-yourself-with-john-sonmez/",
   "Description": ""
 },
 {
   "Podcast Title": "iPhreaks",
   "Description": "The iPhreaks Show is a weekly group discussion about iOS development and related technology by development veterans. We discuss Apple, tools, practices, and code."
 },
 {
   "Podcast Title": "Description\n The iPhreaks Show is a weekly group discussion about iOS development and related technology by development veterans. We discuss Apple, tools, practices, and code. Subscribe URL\n https://itunes.apple.com/us/podcast/the-iphreaks-show/id634022060?mt=2 Episodes John Was On\n Episode 91 talking about Soft Skills and marketing yourself as a software developer\n http://devchat.tv/iphreaks/091-ips-soft-skills-and-marketing-yourself-as-a-software-developer-with-john-sonmez",
   "Description": ""
 },
 {
   "Podcast Title": "React Native Radio",
   "Description": "React Native Radio is a weekly discussion of the tools, techniques, and technologies used to build mobile applications with JavaScript and React done by developers regularly using React Native."
 },
 {
   "Podcast Title": "Description\n React Native Radio is a weekly discussion of the tools, techniques, and technologies used to build mobile applications with JavaScript and React done by developers regularly using React Native. Subscribe URL\n https://itunes.apple.com/us/podcast/react-native-radio/id1058647602?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Fragmented",
   "Description": "The Fragmented Podcast is a podcast for Android Developers hosted by Donn Felker and Kaushik Gopal. Our goal is to help you become a better Android Developer. We chat about topics such as Testing, Dependency Injection, Android Patterns and Practices, useful libraries and much more. We will also be interviewing some of the top Android Developers out there."
 },
 {
   "Podcast Title": "Description\n The Fragmented Podcast is a podcast for Android Developers hosted by Donn Felker and Kaushik Gopal. Our goal is to help you become a better Android Developer. We chat about topics such as Testing, Dependency Injection, Android Patterns and Practices, useful libraries and much more. We will also be interviewing some of the top Android Developers out there. Subscribe URL\n https://itunes.apple.com/us/podcast/fragmented/id968779958?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Release Notes",
   "Description": "Release Notes is a weekly podcast about the business of Mac and iOS indie software development. We discuss inspiration, design, trends, and tools — everything but the code. Each week, we cover topics for the new or curious independent developer looking to make his or her way in the iOS and Mac ecosystem. Tips and tricks, success stories as well as failures."
 },
 {
   "Podcast Title": "Description\n Release Notes is a weekly podcast about the business of Mac and iOS indie software development. We discuss inspiration, design, trends, and tools — everything but the code. Each week, we cover topics for the new or curious independent developer looking to make his or her way in the iOS and Mac ecosystem. Tips and tricks, success stories as well as failures. Subscribe URL\n https://itunes.apple.com/gb/podcast/release-notes/id650358643?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "iOhYes",
   "Description": "A podcast by iOS developers for iOS developers, delivering news, tips, and rants for professional iOS/Mac developers, with something for enterprise and indie developers alike."
 },
 {
   "Podcast Title": "Description\n A podcast by iOS developers for iOS developers, delivering news, tips, and rants for professional iOS/Mac developers, with something for enterprise and indie developers alike. Subscribe URL\n https://itunes.apple.com/gb/podcast/build-phase/id681232605?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "Build Phase",
   "Description": "Build Phase is a weekly technical podcast discussing iOS development and design. Hosted by iOS developers Mark Adams, Jack Nutting, and Gordon Fontenot."
 },
 {
   "Podcast Title": "Description\n Build Phase is a weekly technical podcast discussing iOS development and design. Hosted by iOS developers Mark Adams, Jack Nutting, and Gordon Fontenot. Subscribe URL\n https://itunes.apple.com/gb/podcast/build-phase/id681232605?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "The raywenderlich.com Podcast",
   "Description": "Join Mic and Jake as they discuss every aspect of app development with well-known characters from the developer community. Primarily focusing on Apple technology, but with the occasional dip into other platforms. Find out more at raywenderlich.com"
 },
 {
   "Podcast Title": "Description\n Join Mic and Jake as they discuss every aspect of app development with well-known characters from the developer community. Primarily focusing on Apple technology, but with the occasional dip into other platforms. Find out more at raywenderlich.com Subscribe URL\n https://itunes.apple.com/gb/podcast/raywenderlich.com-podcastthe/id773910890?mt=2",
   "Description": ""
 },
 {
   "Podcast Title": "iOS Dev Break",
   "Description": "iOS Dev Break: 15 minutes of current events, tips, and advice for iOS Developers! Including, but not limited to, discussions of Swift, iOS, watchOS, and tvOS development."
 },
 {
   "Podcast Title": "Description\n iOS Dev Break: 15 minutes of current events, tips, and advice for iOS Developers! Including, but not limited to, discussions of Swift, iOS, watchOS, and tvOS development. Subscribe URL\n https://itunes.apple.com/us/podcast/ios-dev-break/id1157188242",
   "Description": ""
 }
]